{"13_medium_sokoban_puzzles.js": "\"13 Medium Sokoban Puzzles\" is a puzzle game where players must push red-brown boxes onto black goals to complete each level. The game includes various levels of increasing difficulty, featuring walls and obstacles that challenge the player's problem-solving skills. Created by Zachary Miller, it offers a traditional Sokoban-style experience with a series of 13 medium-difficulty puzzles.", "15_puzzle.js": "15 Puzzle is a classic sliding puzzle game where players aim to arrange 15 numbered tiles in ascending order within a 4x4 grid, leaving the last square empty. By sliding tiles into the empty space, the player must achieve the correct numerical sequence from 1 to 15. This game challenges a player's problem-solving and spatial recognition skills.", "1930.js": "In \"Saving the Blobs from the Javas,\" players must simultaneously maneuver both Blobs and Javas to navigate platforms, avoid spikes, and eliminate the Javas. The goal is to reach the portal after all Javas have been defeated, allowing the Blobs to progress to the next level. This strategy-based game demands careful planning and coordination to overcome increasingly challenging obstacles.", "2048.js": "2048 is a classic puzzle game where players combine numbered tiles on a grid to create higher numbers, aiming to reach the 2048 tile. The game involves strategic movement to merge matching tiles while managing grid space to prevent the board from filling up. The game ends when no more moves are possible or the player reaches the 2048 tile.", "2048_Alphabet_Edition.js": "2048 Alphabet Edition is a strategy game where players combine alphabet tiles to achieve higher alphabet tiles, aiming to reach \"L\" to win. This is a modified version of the original numerical 2048 game by Gabrielle Cirulli, providing a fresh and intuitive twist for fans. The game challenges players to think strategically to merge matching alphabet tiles on a grid.", "256.js": "\"256\" is a tile-merging puzzle game where players combine numbered blocks to create larger numbers. The objective is to merge blocks until reaching the 256 tile. The game requires strategic moves to manage space on a 4x4 grid while maximizing the score.", "2D_life.js": "\"2D Life\" is a simulation sandbox game inspired by Conway's Game of Life. Players can control the evolution of a grid of cells using customizable rules to determine cell birth and survival, creating various patterns and behaviors. It's a classic hackable simulation that allows users to explore different rule sets and their outcomes.", "2P_Fighting_Game.js": "\"Fighting Engine\" is a simple 2-player fighting game inspired by classic rock'em sock'em robots and Street Fighter. Players can dodge, punch, unleash hadoukens, and block attacks in a bid to knock out their opponent. The game encourages quick reflexes and strategy, making it a fun competitive experience with friends.", "2Psplashflame.js": "\"2Psplashflame\" is a two-player competitive game where players navigate through levels to reach the exit first. Each player uses a different set of keys to move their character and push blocks, with the goal of advancing through all the levels and achieving the highest score. The winner may earn a reward from the other player.", "2_Player_Maze_Game.js": "Maze Game Starter, created by Cheru Berhanu, is a cooperative puzzle game where two players, red and blue, navigate through mazes to reach color-specific goals. Players must avoid traps and activate color-coded buttons to make certain blocks pushable, requiring teamwork to advance through levels. The game emphasizes fun and friendship as players coordinate their moves to overcome obstacles.", "3072_A_2048_Spin-Off.js": "\"3072\" is a strategy game that is a spin-off of the popular game \"2048\". Players combine the sums of numbered tiles by swiping in different directions to create higher-value tiles, aiming to reach the tile value of 3072 to win. This game adds a new level of challenge and intuitive gameplay to the classic 2048 formula.", "3D_wire_frame_rendererV2.js": "\"3D Wireframe Renderer (v2)\" is a simulation that visualizes three-dimensional objects using wireframe models. Users can navigate the scene by moving the camera forward, backward, left, right, up, and down, and can also rotate the view. The program renders objects from STL files, such as cubes and pyramids, in a simple wireframe style.", "4_Colour_Drawing.js": "\"4_Colour_Drawing\" is a sandbox-style drawing game where players create pixel artwork using a color palette reminiscent of the original Game Boy, featuring black and shades of grey. The game's resolution is set at 20x18 but can be adjusted. Players move a cursor to place different colors, creating their own monochromatic masterpieces.", "5-in-1-Carnival-Game-Pack!.js": "\"5-in-1 Carnival Game Pack!\" is a collection of five different mini-games set in a fun carnival environment. Navigate through a virtual fairground to participate in various challenges, including racing, whack-a-mole, playing a piano, and shooting zombies. Each game offers unique and engaging experiences, creating a delightful carnival atmosphere.", "8-Sprig.js": "\"8-Sprig\" is a puzzle game inspired by the classic 8-puzzle, where players move numbered tiles to arrange them in order. The game offers both a speedrun mode, allowing players to compete against the developer's personal best, and an endless mode that generates random puzzles to solve. Music is provided by FructosePear.", "9_puzzle.js": "\"9_Puzzle\" is a logic-based game where the objective is to cover pink tiles with red ones by moving white tiles using strategic pulls. The player navigates through levels by solving these tile puzzles.", "A_Really_One_Sided_Duel.js": "\"**A_Really_One_Sided_Duel**\" is an endless game where the player must defend their country by moving side to side and shooting at incoming enemies while dodging meteors and enemy projectiles. Players earn points each time they hit an enemy, with the goal of reaching 10 points to win. The game also presents the challenge of managing health points which decrease when enemy projectiles hit the ground.", "Advent_of_Sprig.js": "\"Advent of Sprig is a holiday-themed game where new levels or mini-games are added daily during an event period. The main gameplay involves navigating various puzzles and challenges to reach goals, often involving interacting with objects like boxes and switches. Each day offers a new adventure, keeping the experience fresh and engaging.\"", "Alien-poop.js": "\"Alien Poop\" is a beginner-level game where players navigate an alien character to push poop into a toilet, aiming to clear levels by cleaning the world from waste. The game involves solving puzzles by moving the character to push boxes (representing poop) into goals (representing toilets). As levels progress, players will encounter different obstacles and increasingly complex layouts.", "Alien_Attack.js": "Alien Attack is an arcade-style shooter game where players control a character at the bottom of the screen, shooting lasers to eliminate incoming aliens. The objective is to score as many points as possible by shooting aliens while avoiding crashes, with the game's difficulty increasing every 25 points. The game features vibrant pixel art, engaging sound effects, and progressively challenging gameplay.", "Amazeing.js": "\"Amazing\" is a maze-solving game where players navigate through various levels, collect coins, and use keys to unlock blocked paths. The mechanics are inspired by the game Maze Runner 3 by Charlie, emphasizing strategic movement and puzzle-solving.", "Amazing_Mazes.js": "Amazing_Mazes, created by Dexter Speed, is a sokoban-style puzzle game where players navigate through intricate mazes. The objective is to maneuver the player character to cover all goal tiles, progressing through increasingly complex levels. The challenge lies in figuring out the correct path to complete each maze efficiently.", "Amoeba.js": "Amoeba is a two-player strategy game based on Gomoku, where players take turns placing marks on an infinite grid, aiming to align five consecutive marks horizontally, vertically, or diagonally. The opponent tries to block these attempts to achieve their own victory. This timeless game combines strategic depth with simplicity.", "AmongTheStars.js": "\"Among_The_Stars\" is an endless game where players navigate through a treacherous field of stars that hide dangerous secrets. The objective is to survive and fight off enemies that appear among the stars, while avoiding being blinded by the shimmering lights. Players can upgrade their weapons to improve their chances of survival.", "Amongus_flight.js": "\"Amongus Flight\" is an endless game where players control a character to navigate through obstacles. The objective is to avoid blockers and earn points while the speed of the game gradually increases. The theme is inspired by the popular game Among Us, featuring a character resembling the game's crewmates.", "Anomaly.js": "\"Anomaly\" is a suspenseful adventure game where players navigate through various levels, avoiding demons and anomalies while solving puzzles to progress. Set in a world with an eerie atmosphere, the game features themes of mimicry and the unknown, urging players to stay on their toes as they encounter various obstacles and find safe paths. The goal is to explore the environment carefully, pushing objects and deciphering clues to advance through the story.", "Antivirus.js": "\"Antivirus\" is a game where you control a small computer character to fend off incoming virus enemies. Inspired by Space Invaders, it features mechanics that require players to dodge and attack viruses from multiple directions. The game employs a combination of directional inputs to move and corresponding keys to fire at the threats.", "Apple_Skedaddle.js": "\"Apple Skedaddle is a Sokoban-style puzzle game where you play as an apple trying to reach your Watermelon friend. Navigate through mazes filled with perilous bombs that you must outsmart to achieve your goal. Each level presents increasingly complex challenges to test your problem-solving skills.\"", "Arcade-Treasure.js": "Treasure Quest is an adventure puzzle game where players navigate through obstacles and puzzles to find hidden treasures while avoiding enemies. The gameplay involves strategic movement and problem-solving within a dynamic environment. The goal is to reach the treasures without being caught by enemies.", "Art.js": "\"Art\" is a sandbox-style digital art game where players can create and modify pixel art on an 8x8 grid. The game allows users to move a cursor, select colors, draw, and reset their artwork with various key commands. It provides an open-ended environment for creativity without specific objectives or levels.", "Asteroid_Apocalypse.js": "Asteroid Apocalypse is an endless game where you defend your base from incoming asteroids by controlling a laser with the keyboard. Dodge and destroy the asteroids before they reach and destroy your base. The game gets more intense as you gain points by successfully hitting the asteroids.", "Asteroid_Dodge.js": "Asteroid_Dodge! is a dodge game where players control a spaceship, maneuvering to avoid incoming asteroids while collecting coins for points. The game's difficulty increases over time, making it progressively harder to navigate through the field of obstacles. It features a visually simple, yet engaging, space theme.", "Asteroid_Field.js": "Asteroid Field is a game where players navigate a spaceship through a hazardous asteroid field, attempting to reach a distant goal. The player, lost in space, must skillfully maneuver to avoid collisions and continue the endless journey for a place to call home. The game's setting and obstacles provide a thrilling and challenging space adventure experience.", "Astrovoid.js": "Astrovoid is an endless game where players control a spaceship, attempting to avoid falling asteroids. The difficulty increases as the player's score rises, with more asteroids appearing on the screen. The primary objective is to survive as long as possible while maneuvering through the asteroid field.", "Avoid_The_Tree.js": "Avoid_The_Tree is an endless game where players control a bird flying through a forest, trying to avoid colliding with trees. The objective is to fly as far as possible while navigating obstacles that appear randomly. The game features score tracking and progressively challenging gameplay as players attempt to achieve the highest score.", "BRICK_DODGER.js": "\"Brick Dodger\" is an endless game where players must dodge falling bricks by moving left or right. Players accumulate points as they avoid the bricks, with the game progressively increasing in difficulty. The game ends when a player is hit by a brick, displaying their final score.", "Bad_Apple.js": "\"Bad_Apple\" is a port of the well-known \"Bad Apple\" music video, presented as a playback animation on the Sprig platform. The theme centers around showcasing the video, adding to the growing list of unconventional devices capable of playing it. This project is created for demonstration purposes and is marked as an \"advanced\" implementation of animation on Sprig.", "Bash_Game.js": "\"Bash_Game\" is a strategic two-player game where each player alternates turns to take 1 to 4 coins, vying to be the one to take the last coin and win a gold sack from their opponent. Both players aim to collect all 6 sacks to win the game or risk losing if all their sacks are stolen. The game involves planning and anticipating the opponent’s moves to avoid leaving the last coin for the opponent.", "Battle_City.js": "\"Battle City\" is a classic NES game where players control a tank and must defeat enemy tanks by shooting them. The game features destructible walls and various levels, requiring strategic movement and shooting. Players automatically respawn upon death, emphasizing continuous action and tactical gameplay.", "Battleship.js": "\"Battleship\" is a strategic two-player game where each player places ships on a grid and tries to guess and destroy the opponent's ships. Players take turns targeting grid coordinates in an attempt to sink all of the opponent's fleet. It's a classic game of strategy, deduction, and naval warfare.", "Bert_Blaster.js": "\"Bert Blaster\" is an endless action game where players control a character navigating through various terrains, dodging obstacles, and shooting at enemies. The objective is to survive as long as possible while increasing your score. The game features a continuous scrolling environment with a combination of different terrain types, enemies, and obstacles.", "BigButton.js": "\"BigButton\" is a simple yet challenging reflex game where you must press a specified button when prompted. The game attempts to waste your time by making it difficult to beat, often mocking your performance. It involves waiting for the screen to turn red, pressing the correct button, and then restarting the game once insulted.", "Binary_Eater.js": "Binary Eater is a logic-based game where players input binary commands using specific key combinations to type characters from 'a' to 'z', which are then eaten by a binary-eater character. The objective is to type as many valid characters as possible before the eater finds the input empty, without making any errors. Players must act quickly and accurately to achieve high scores while managing the binary-eater's pace.", "BlastOff.js": "\"BlastOff,\" created by Fahad, is an endless runner game where players control a rocket navigating through the sky and dodging incoming birds. The objective is to avoid collisions and achieve the highest possible score. The game's difficulty escalates as the player progresses, rewarding quick reflexes and sharp focus.", "Blob_Runner.js": "Blob_Runner is a platformer game that challenges players to navigate through mazes as a little blob. The objective is to reach the right side of the screen to progress to the next level while avoiding obstacles like spikes and blockers and using keys to unlock pathways. Each level introduces different mechanics and puzzles, offering a progressively challenging experience.", "BlockMaze.js": "BlockMaze is a puzzle game where you navigate a player through a maze, painting the floor behind you as you move. The objective is to fill every tile in the maze to advance to the next level. Additionally, collectibles can be gathered throughout the levels for extra challenges.", "BlockPuzzle.js": "\"BlockPuzzle\" is a strategy game where the player must reach a portal by pushing blocks, while avoiding an enemy and not exceeding a move limit. Players need to plan their moves and use the blocks to create a path to the portal, making each level a unique puzzle. The challenge increases with each level, requiring strategic thinking to navigate through intricate layouts and avoid being caught.", "Block_Stacker.js": "\"Block_Stacker\" is a simple yet challenging game where players aim to stack moving blocks on top of each other by timing their placements precisely. The goal is to build the tallest stack possible, reaching the top of the screen without letting the blocks fall out of alignment.", "Boba_Maze.js": "Boba Maze is a puzzle game where players navigate through mazes themed around the process of making a boba drink. Each level represents a step in the creation of boba, such as collecting ingredients like tapioca leaves, boba balls, black tea leaves, and adding water and cream. Players must reach the snowglobe in each maze to advance to the next level and ultimately complete their boba drink.", "Bomberman.js": "\"Bomberman\" is a two-player game where players compete to outmaneuver each other and plant bombs in an enclosed arena with multiple random maps. Players must navigate through obstacles and breakable walls and can collect upgrades to increase the number of bombs they can place or the range of their explosions. The game ends when one player successfully bombs the other, declaring the surviving player as the winner.", "Bottom_of_the_Barrel.js": "\"Bottom_of_the_Barrel\" is an advanced strategy RPG game where players ascend a series of levels by fighting various enemies in turn-based combat. The ultimate goal is to climb to the top of the metaphorical barrel. As players progress, they encounter increasingly challenging foes and can use items and special attacks to aid in their quest.", "BoxCubeGuy.js": "BoxCubeGuy is a Sokoban-style puzzle game where players must navigate a character to push boxes onto designated goal tiles within a maze-like level. By strategically moving walls and avoiding obstacles, players advance through progressively challenging levels. The game emphasizes problem-solving and spatial awareness.", "BoxMaze.js": "BoxMaze is a puzzle-based maze game where players push boxes onto activators to open walls, ultimately aiming to reach teleporters to advance to the next level. The game becomes increasingly challenging with multiple boxes and activators requiring strategic thinking to progress. Created by Kalo, it tests logical skills in navigating complex mazes.", "Box_Guy.js": "\"Box Guy\" is an extremely challenging and relentless puzzle game where you play as Box Guy, aiming to complete ten levels by reaching the door on each map. The game involves navigating around immovable walls and strategically using moveable boxes to overcome obstacles. It's inspired by the classic \"Block Dude\" game originally designed for the TI-83 Plus calculator.", "Box_Jump.js": "Box Jump is a puzzle-score game where players must push purple boxes onto green goals to advance through levels. Each level requires the player to edit the game's code to introduce new mechanics or solve the puzzle. The game encourages creativity by providing tips for making modifications and even creating your own custom game.", "Boxxod.js": "Boxxod is a logic-based gravity game where players push boxes around to navigate the red cube to the green goal. It involves shifting all movable boxes in any direction to achieve the objective, challenging players to think differently about spatial relationships and gravity effects. A unique twist on traditional box-pushing puzzles, Boxxod tests both logic and creativity.", "BrainTeaserMaze.js": "BrainTeaserMaze is a sokoban-style puzzle game where the objective is to navigate a player through a series of challenging mazes to reach a green square. Players must think strategically to move through the maze while avoiding obstacles. The game progressively increases in difficulty with each level.", "BreadMaze.js": "BreadMaze is a Sokoban-style puzzle game where players push orange boxes to cover goal tiles within a time limit. Players navigate through levels filled with obstacles, including bread tiles and other pushable objects. The objective is to strategically move the boxes to achieve victory before the time runs out.", "Breakout.js": "\"Breakout\" is a classic arcade game where players control a paddle to bounce a ball and break all the blocks on the screen. The game involves precise timing and strategic movement to keep the ball in play and clear the level. Players earn points by successfully breaking blocks and must avoid letting the ball fall off the screen.", "Builder.js": "\"Builder\" is a strategy game where the player must maneuver boxes to reach designated goals. The levels involve navigating obstacles and strategically placing boxes to clear each stage. Players use movement controls and box placement commands to solve each puzzle and advance through the levels.", "BulletRun.js": "Bullet Run, created by Vivaan Shahani, is a strategy game where players must navigate from the starting point to a goal without being hit by moving bullets. Players need to think ahead and plan their moves to avoid obstacles and enemies along the way. The game includes various levels and random level generation for continuous challenges.", "Burger_Maker_V1.js": "Burger_Maker is a thematic puzzle game where you play as Mr. Chef, an up-and-coming burger maker who is on the verge of becoming the best in the world. The goal is to push various burger ingredients into their designated spots, but there are mazes and obstacles to navigate around. Only one ingredient can be pushed at a time, adding a layer of complexity to assembling the perfect burger.", "CATCH-ME.js": "\"Catch Me if you can\" is a pattern-identifying game where players navigate through 5 progressively complex levels to catch a goal. As players advance, the interaction between the player character and the goal becomes more intricate, requiring strategic movement to win. This engaging puzzle game continually challenges players with its increasing difficulty.", "Call_911.js": "\"Call 911\" is a strategy game where players control a firetruck to navigate through various levels, extinguishing fires and rescuing areas in distress. The game comprises different levels, each with its unique layout and obstacles, requiring careful planning and movement within a limited number of moves. Its theme revolves around firefighting and emergency response, challenging players to act quickly and efficiently.", "Castle_Drop.js": "\"Castle_Drop\" is a fast-paced dodge game where players navigate a character falling through a castle, avoiding deadly spikes while collecting life pads to maintain or boost health. The goal is to stay alive as long as possible by dodging hazards and managing lives effectively.", "Catch-the-apples.js": "\"Catch the Apples\" is an endless game where players aim to catch falling apples to increase their score while avoiding bugs that decrease it. Players control a basket, moving it left and right to catch apples before they hit the ground. The game progressively gets more challenging as both apples and bugs fall more frequently.", "CatchIt.js": "CatchIt is a simple game where the player must catch falling points to increase their score. The challenge is to move left or right using the 'a' and 'd' keys to catch the points while avoiding missing too many, which leads to a game over. The game is inspired by the mechanics of \"A_Really_One_Sided_Duel\" and \"Falling_Blocks\".", "Catch_the_Acorn.js": "\"Catch_the_Acorn\" is a puzzle game where players control a hungry squirrel trying to collect acorns to eat. The squirrel navigates through various levels by pushing boxes, avoiding traps, and using portals to reach the acorns. The goal is to guide the squirrel to each acorn while overcoming obstacles along the way.", "Catch_the_Egg.js": "\"Catch_the_Egg\" is a game where you move a basket to catch eggs laid by hens. The objective is to position the basket below the hen that is about to lay an egg to collect it, avoiding misses. The game ends after too many misses or when you reach a high score.", "Catch_the_star.js": "\"Catch the Star\" is a puzzle game where players control a reindeer tasked with catching a star while collecting gifts as a side quest. Players navigate the reindeer through different levels by avoiding obstacles like grass to gather all gifts before reaching the star. The game features increasing levels of difficulty designed to challenge strategic thinking.", "Cave-Quest.js": "Cave-Quest is a puzzle-adventure game where players take on the role of an explorer navigating through dangerous caves filled with traps and obstacles. Inspired by Spelunky, the game challenges players to solve puzzles by pushing boxes and avoiding traps across 10 increasingly difficult levels to reach the exit. Be careful, as losing all hearts sends you back to the start!", "CaveEscape.js": "CaveEscape is a turn-based strategy game where players navigate through a cave using three unique skills to defeat enemies and ultimately escape. Players must balance their actions and resources, choosing between attacking, gambling for health or mana, and casting powerful hexes, while enemies automatically counterattack after each player move. The player wins by successfully progressing through the levels and escaping the cave.", "CaveGame.js": "**CaveGame** is a simple puzzle adventure game where players navigate through dungeons, collecting gold and battling monsters. Players use WASD for movement, I to attack/mine, and can purchase items to aid their journey. The objective is to escape the cave by solving puzzles and defeating enemies, making strategic use of available resources.", "ChaseEscape.js": "Chase Escape is a dodge game where the player must avoid being caught by a pursuing entity known as 'Orange Face'. The game offers different difficulty modes; players use directional inputs to navigate the playing field, trying to stay away from Orange Face. If caught, the game ends immediately.", "CheckerInvasion.js": "Checker Invasion is an endless survival game where you play as a stationary checker that must use a cursor to defend against incoming enemy checkers. Your goal is to shoot as many enemies as possible while avoiding collisions, which decrease your health. The game ends when all your hearts are depleted.", "Cheese-Hunt.js": "Cheese-Hunt is a puzzle game where the player guides a mouse through various obstacles to find and collect cheese. The gameplay involves navigating through traps, breaking boxes, and using tunnels to move between different parts of the levels. The objective is to successfully reach the cheese while avoiding or overcoming obstacles.", "Cheese_Terminator.js": "Cheese_Terminator is a port of the classic Microsoft Cheese Terminator game, originally distributed in Poland through Microsoft surveys. This Sokoban-style puzzle game involves pushing cheese wheels onto red dots across various levels. Originally revitalized as Cheese Terminator: Reloaded for Windows Phone in 2015, it's now available to play for free online.", "Christmas_Themed_Sokoban.js": "\"Christmas_Themed_Sokoban\" is a Sokoban-style puzzle game in which players control a Candy Cane Character to push presents under Christmas trees within 60 seconds to complete each level. The game challenges players to solve festive-themed puzzles by strategically moving obstacles and presents through various maps. Complete all levels to win a special prize.", "Civilization_Builder.js": "Civilization Builder is an advanced strategy game where players aim to create the most powerful civilization by enhancing their economy and training military units to defeat neighboring nations. Players will manage resources like food and gold to build various structures such as farms, mines, and barracks, while also utilizing human units to construct buildings and train soldiers. The game involves turn-based movement and decision-making, with players competing against an AI-controlled opponent.", "Clutter_Cleanup.js": "\"Clutter Cleanup\" is a puzzle game where the player uses fire to clean up boxes scattered around various levels. Navigate through obstacles, set boxes on fire, and use water to clear out fires strategically. The goal is to clear all boxes without running out of fire sources.", "Colour_Game.js": "Colour_Game is an endless game where players earn points by pressing the correct button corresponding to the color displayed on the screen. Players press J for BLUE, L for GREEN, and A for BLACK, with the square color changing randomly. The game ends if the wrong button is pressed.", "ConnectX.js": "ConnectX is a multiplayer game where two players compete in a series of Connect 4-inspired rounds that scale from Connect 3 to Connect 12. Each round, players take turns placing their colored chips into columns, aiming to get a sequence of \"X\" chips to win the round. The player who wins the most rounds after 10 rounds is declared the winner.", "Conquerers.js": "\"Conquerers\" is a multiplayer strategy game where players place ships to claim the most tiles on the board. Players take turns positioning their ships next to existing ones to expand their area of control. The game ends when no more ships can be placed, and the player with the most tiles wins.", "Cookie_Click!.js": "Cookie_Click! is a classic cookie-clicker game where players collect cash to upgrade their cookie to higher tiers, aiming to reach the coveted Legend upgrade. Players simply press a key to collect points and another key to purchase the upgrades. The game challenges persistence and efficiency as players work towards achieving the final upgrade.", "Countdown_Golf.js": "Countdown Golf is a logic puzzle game based on Herugolf. Players hit balls labeled with numbers into holes, ensuring the balls travel the exact number of spaces indicated and do not cross each other’s paths. The game features 360 original courses, each with a unique solution, and includes water hazards and a score-tracking system for strokes.", "CowCrossing.js": "Cow Crossing is an arcade-style game where the player helps a cow avoid getting hit by speeding cars while navigating a busy road. Some cars are faster than others, and special milk trucks can provide a boost if hit. The objective is to achieve 1000 points by skillfully dodging the vehicles and reaching the scoring milestone.", "Cricket-Dodge.js": "Cricket Dodge is an endless game where you must protect the wicket from being hit by falling cricket balls, moving left and right to dodge them. You start with 5 lives and lose one each time a cricket ball lands on the wicket. The game ends when you lose all your lives.", "Cross_The_Road.js": "\"Cross_The_Road is an endless game where players dodge randomly spawning vehicles to reach the finish line. The goal is to navigate the road without getting hit by moving traffic. The longer you survive, the higher your score will be.\"", "Crossy Road.js": "\"Crossy Road\" by Bunnzulu is an arcade-style game where players navigate a character through lanes of traffic filled with colorful cars. The goal is to avoid collisions and advance as far as possible. The game includes different stages and an increasing difficulty level to keep players engaged.", "Crossy_Sprig.js": "\"Crossy_Sprig\" by hatanuk is an endless, Frogger-like game that answers the question, \"Why did the chicken cross the road?\" Players guide a chicken, avoiding obstacles like cars and trucks while moving forward on grass, asphalt, and roads. The goal is to survive as long as possible and achieve a high score with no backward movement allowed.", "CrusaderTheGame.js": "\"Crusader\" by Skyfall is a challenging platformer where players navigate through levels filled with various hazards such as spikes and lava. The game requires players to collect coins and keys to unlock portals, all while avoiding deadly traps. Each level tests the player's timing and precision, combining exploration with problem-solving skills.", "Cup_Game.js": "\"Cup Game\" is a memory and observation game where players guess which cup hides a ball after they have been shuffled. The cups mix themselves up, and the player must track the ball's location, then select the correct cup to increase their score. The objective is to achieve the highest score by accurately following the shuffles and making successful guesses.", "Custom_Tic_Tac_Toe.js": "Custom Tic Tac Toe is a versatile multiplayer game where players can play on a customizable grid with variable win conditions. Players can adjust the grid size and the number of marks required in a row to win, and can also enable \"crazy mode,\" where any sequence of consecutive marks, regardless of the symbol, results in a loss. The game dynamically generates boards based on the specified settings, offering diverse and unique gameplay experiences.", "Dance_Dance_Engine!.js": "Dance Dance Engine!! is a rhythm game engine that lets users easily create their own rhythm games. The theme revolves around matching notes to directional inputs (up, down, left, right) in sync with looping music. Users can define note types and music, and the engine handles the mechanics to make the rhythm game work.", "Darkening_Descent.js": "Darkening Descent is an advanced roguelite game where players explore randomly generated dungeons filled with enemies, secrets, and upgrades. The adventure takes you from the Surface through the Caverns and into the Hollows, uncovering mysteries and defeating bosses to reach the Earth's core. Each playthrough presents a unique challenge, enhancing replayability and keeping the dungeon-crawling experience fresh and engaging.", "Davinci-Lit-Demo.js": "\"Davinci Lit Trivia\" is an educational platformer game inspired by Mario Brothers. It helps kids study while having fun by navigating through levels, avoiding hazards like acid and enemies, and collecting strawberries to reach the goal. Players will need to solve trivia questions embedded in mystery boxes and use power-ups to proceed through the game.", "Defend_the_Keep.js": "\"Defend_the_Keep\" is a dodge-themed game where players protect a keep from incoming bullets by skillfully rotating and positioning a shield. Players use movement controls and rotation commands to intercept and destroy bullets before they can breach the keep's defenses. This requires quick reflexes and strategic maneuvering to survive waves of attacks.", "Desine_Mini.js": "\"Desine Mini\" is a challenging game centered around defeating and dodging enemies as you progress through various levels. The gameplay focuses on strategic movements and timed attacks against different types of adversaries, including a formidable boss. It provides an intense experience for players looking for an advanced platform with obstacles and combat dynamics.", "Destroy_The_Hearts.js": "\"Destroy_The_Hearts\" is a Sokoban-style puzzle game where players push boxes, represented by swords, onto heart-shaped goals. The objective is to clear each level by strategically moving boxes to designated spots, avoiding obstacles like walls. It's a simple yet engaging brain-teaser about planning and precision.", "Disco.js": "\"Disco\" is a rhythm-based game where players act as a DJ, matching falling arrows with the corresponding keys to keep the music playing. Blue arrows use the WASD keys, while red arrows use IJKL, with increasing speed and difficulty. Missing or incorrectly matching arrows results in lost points.", "Divine_Tree_Man_Saves_A_Forest.js": "\"Divine Tree Man Saves A Forest\" is a puzzle game where you play as a divine tree man trying to save a forest from threats like deadly fungus, forest fires, and invaders called Zire. Players must strategically use pushable items to solve each level's challenges, keeping in mind that getting items stuck can softlock the game. The game features 7 levels, with the final goal of eradicating the evil force known as Ezir to restore the forest.", "Dodge_The_Rock.js": "\"Dodge_The_Rock\" is an arcade-style game where players must avoid falling rocks to score points. The game features increasing difficulty levels to keep it engaging. If a player is hit by a rock, the game ends.", "Dodgy-Day.js": "\"Dodgy Day\" is an action-packed game where players must dodge various obstacles to survive. As time progresses, the difficulty increases with faster and more frequent bomb spawns. Players need to collect \"difuse\" sprites to prevent instant defeat and manage their limited health represented by hearts.", "DogsvsCats.js": "\"Dogs vs Cats\" is an endless game where a dog must dodge incoming cats to survive. Players control the dog's vertical movement to avoid collisions with the cats. The game features a simple yet challenging premise designed by a beginner coder named Theodor.", "DontGetBurnt.js": "\"Don't Get Burnt!\" is an action game where you play as Crummington, a slice of bread attempting to evade evil toasters in a bid to escape their fiery clutches. Dodge the toasters and collect jam jars to boost your score as you navigate the hazardous environment. Can you help Crummington make a daring getaway?", "Doomed.js": "\"Doomed\" is a single-player shooter game where players must shoot and kill progressively harder waves of demons before facing a final boss. Inspired by the game Doom, it challenges players to survive and navigate through various levels, defeating increasingly tougher enemies. To win the game, players must beat the final boss while managing their progressively shrinking arsenal and health.", "Dragon-Rush.js": "Dragon-Rush is a Sokoban-like puzzle game where players control a cute dragon tasked with pushing a flower to a green spot. The game features progressively challenging levels where players must avoid red areas, push crates, collect keys to open gates, and utilize portals. Developed by Xhaiden, Aaron, and Brenden, this work-in-progress game combines strategy and problem-solving with charming visuals.", "Dragon_Fest.js": "\"Dragon_Fest\" is an endless survival game where the objective is to survive for one minute by shooting down approaching orbs with fireballs. Players navigate a dragon using specific movement controls and must prevent the orbs from reaching the hedge. Victory is achieved by lasting the full duration without letting too many orbs pass through.", "Duck_Hunt.js": "\"DCKHNT\" is a whimsical chase game where a duck has stolen your baguette, and you must retrieve it despite being low on energy. The game's challenge lies in catching the duck by strategically moving in fewer steps than your remaining energy. It’s a playful pursuit requiring quick movements and efficient planning.", "Dungeon.js": "\"Dungeon\" is a maze-like game where you must navigate through a dungeon to find a way out. You need to locate keys to unlock doors that block your path to the exit. The game requires careful exploration and problem-solving to progress through various levels.", "Dynamic_Adventure.js": "\"Dynamic_Adventure,\" created by Alexis Martel, is a hit-the-target game where the objective is to navigate a rabbit to a flag. The game consists of various levels with increasing difficulty, featuring obstacles such as lava, poison, and water tiles. Each level presents unique challenges, requiring players to carefully maneuver the rabbit to reach the flag and progress.", "Eat_&_Dont_Be_Eaten.js": "\"Eat & Don't Be Eaten\" is a catch-themed survival game where the player navigates a grid to collect food while avoiding an enemy that constantly moves towards them. The game ends when the enemy catches the player, and the objective is to accumulate the highest score by eating as much food as possible.", "Electrikoban.js": "Electrikoban is a strategy game where players push wires to connect and power lights. The goal is to position the wires correctly to illuminate all the lamps on the level. Players must think carefully about their moves to successfully complete each puzzle.", "ElfSokoban.js": "ElfSokoban is a Christmas-themed puzzle game where you play as an elf helping Santa by pushing presents to designated locations. Each level offers increasing difficulty with various obstacles to navigate. There are 17 levels to complete, providing a festive and challenging experience.", "English_Checkers.js": "\"English Checkers\" is a digital recreation of the classic board game also known as draughts. Players take turns moving their pieces diagonally across a checkered board, capturing opponent's pieces by jumping over them. The objective is to eliminate all opponent's pieces or block them from making any legal moves.", "Escape_From_Ghost_Maze.js": "\"Escape from Ghost Maze\" is a puzzle game where the player must navigate through mazes while being pursued by a ghost that can move through walls. The objective is to reach the exit door of each level while strategically using talismans to momentarily stun the ghost. The game offers two difficulty levels, making it a challenge to both new and seasoned players.", "Exodus.js": "Exodus is a game where players must navigate through levels, avoiding moving ogres while trying to reach the gate at the end. Players need to use strategy and timing to avoid collisions and advance through increasingly challenging stages. The game features a limited number of lives, adding to the difficulty and excitement.", "FOOD-CATCH.js": "FOOD-CATCH is a fast-paced game where players must catch falling food items with their player character to earn points. If the player misses three food items, the game ends. Move the player left and right to catch as many falling items as possible before reaching the limit of missed items.", "FRC-CHARGED-UP.js": "\"FRC CHARGED UP\" is a competitive game where players control robots to move cones and cubes into their respective alliance grids, aiming to score the most points in the shortest time. Players must strategically navigate the field, utilizing grids and charging stations while avoiding obstacles and playing defense against their opponent. The first player to fill their grid wins.", "FRC_TEAM_2016_Monkey_Madness.js": "\"FRC_TEAM_2016_Monkey_Madness\" is a dodge game where you control a member of the FRC Team 2016, the Mighty Monkey Wrenches, to defeat enemy robots named Nemesis. Players must move to avoid enemy robots while shooting lasers to destroy them and rack up points. The game features escalating difficulty with enemies becoming faster and more frequent as your score increases.", "Faby_Flies.js": "\"Faby Flies\" is a classic endless flappy bird clone game where players navigate a bird through a series of pipes to earn points and unlock medals. The bird moves up and down to avoid obstacles, with the goal of achieving the highest score possible before colliding. The game features different difficulty levels and secret cheat codes for additional challenges.", "Falling_Blocks.js": "\"Falling Blocks\" is an action game where players must dodge falling blocks by moving left and right. The goal is to avoid getting hit as long as possible, using quick reflexes and timely movements. The game ends when the player runs out of lives, and the final score is based on survival time.", "Falling_Water.js": "\"Falling Water\" is a simulation game that mimics the behavior of water using cellular automata. Players can observe how water interacts with walls and other elements in a dynamic and visually engaging environment. It's a creative experiment in simulating natural phenomena using simple rules.", "Find_The_Suspect.js": "\"Find the Suspect\" is a detective-themed game where you play as a police officer tasked with identifying a thief among 12 suspects. Based on a description of the perpetrator, your goal is to determine if each presented individual matches the criteria and make an arrest. The objective is to correctly identify the thief to win the game.", "Fire_Hound.js": "\"Fire Hound\" is a puzzle-score game where players control a fire hound trying to reach home by passing through endless portals while dodging raindrops. The challenge involves strategic movement and the use of a shield to survive the obstacles. The aim is to pass as many portals as possible to achieve a high score, either solo or by taking turns with friends.", "Fish_in_the_Sea.js": "\"Fish_in_the_Sea\" is a strategy game where players navigate a maze to reach portals while managing limited energy. Each move depletes energy, and players can collect energy boosts to continue their journey. The game features various levels with increasing difficulty.", "Flamin_Finger.js": "Flamin' Finger is a timer-based puzzle game where you must navigate a pointer to collect white circles on each level. The game involves using the WASD keys to move while avoiding barriers and racing against the clock. Each level is carefully tested to ensure its solvability and offers a classic arcade-style challenge.", "Flip_a_Coin.js": "\"Flip a Coin\" is a classic game that simulates the simple action of flipping a coin, potentially revealing hidden Easter eggs. Players can flip the coin by pressing a button, and the game will randomly display either heads or tails. The theme revolves around the timeless and straightforward activity of coin flipping with a touch of interactive fun.", "Flurffy.js": "\"Flurffy\" is a time-based obstacle navigation game inspired by \"Flappy Bird.\" Players must guide their character through a series of increasingly challenging levels within 35 seconds to win. Completion of each level involves avoiding obstacles and reaching the goal area.", "Formula_1.js": "\"Formula 1\" is a multiplayer racing game where two cars compete in a series of races. Players navigate their cars to the finish line while avoiding obstacles like pits, birds, and cones. The first car to win three races is declared the champion.", "Friendly_Figures.js": "Friendly Figures is a Sokoban-style multiplayer game where two characters, Circle and Square, navigate through complex mazes to reach their respective home doors. Players must work together to solve puzzles and unlock pathways. The game emphasizes teamwork and strategy as both characters have distinct controls and must collaborate to progress through each level.", "Frog_Maze.js": "Frog_Maze is a puzzle game where the player navigates progressively harder mazes to guide a frog to a lilypad at the end of each level. The game involves maneuvering through complex pathways while avoiding obstacles. It challenges players to use strategic thinking and spatial awareness skills.", "Fruit_Catcher.js": "Fruit Catcher is a simple and fun catching game where players move a bowl using keyboard controls to catch falling fruits like apples and oranges. The objective is to collect as many fruits as possible to increase the score. The game features a sky background and a ground level, with fruits dropping from the top of the screen.", "Galacticats.js": "\"Galacticats\" is a puzzle game where players control a space cat to navigate through levels filled with moving enemies to reach a portal or spaceship. The enemies' movement is directly influenced by the player's moves, creating strategic challenges. The main objective is to avoid enemies and reach the goal safely.", "Galaxy_Dodger.js": "\"Galaxy Dodger is a space-themed game where players dodge and destroy asteroids approaching from all directions. Players build their own spaceship from a randomly chosen set of components that affect movement capabilities. The goal is to avoid or destroy the asteroids for as long as possible using the limited controls of the custom-built ship.\"", "Get the Gift!.js": "\"Get The Gift\" is a two-player game where one person plays as a dog and the other as a cat, trying to reach a goal while navigating a maze and avoiding each other. The primary objective is for the dog to capture the gift while the cat tries to stop it. The game features multiple levels with increasing difficulty and musical elements to enhance the experience.", "Goblin_Gobbler.js": "\"**Goblin Gobbler** is a puzzle game where your goal is to strategically maneuver goblins into holes in the ground. Players use boxes and various directional movement mechanics to achieve the objective. Each level offers unique challenges and obstacles, making the game progressively more difficult.\"", "Golem-Rush.js": "Golem-Rush is an action game where a golem tries to avoid trees while running down a hill. Players steer the golem left or right to dodge obstacles that appear randomly on the screen. The game ends when the golem hits a tree, and players can restart the game to try for a higher score.", "Guess_the_tune.js": "\"Guess the Tune\" is a memory-based game where players listen to a sequence of melodies and then try to replicate it by pressing the corresponding keys. As the game progresses, players can adjust the length of the melody sequences to increase or decrease the difficulty. The game emphasizes auditory memory and pattern recognition.", "Half-fry.js": "\"Half-fry\" is a puzzle-platformer game where the player controls a half-fried food item that aims to become a fully fried delicacy by collecting volts and reaching the frying pan. Players navigate through levels filled with traps, pushable boxes, and portals. Created by Abhay Gupta, the game combines strategic movement and timing to complete each stage.", "Hard-Hat_Helper.js": "\"Hard-Hat Helper\" is a puzzle platformer inspired by \"Mario vs. Donkey Kong: Mini-Land Mayhem!\" for the 3DS, where players guide a hard-hat-wearing character to the level's goal. The player manipulates various elements like platforms, lifts, and conveyor belts to clear paths and overcome obstacles. This engaging game requires strategic use of level elements to progress through increasingly complex stages.", "Hectic_Hockey.js": "Hectic Hockey is a straightforward game inspired by Frogger, where the objective is to navigate your player to the right side of the screen without colliding with moving enemy players. Set on an ice-themed map, players must dodge opponents that continuously spawn and move towards them. It’s a challenging dodge game that resets your progress upon collision.", "Hey_Hay_Cow.js": "\"Hey Hay Cow\" is a maze navigation game where players guide a cow through various levels to reach its desired hay. The game includes obstacles and buckets that can be pushed, adding to the challenge. The theme centers around farm elements with a playful and engaging atmosphere.", "Hungry-Ninja.js": "\"Hungry Ninja\" is a game where players control a ninja tasked with collecting as many apples as possible while navigating through orchards filled with bombs. The game's main challenge lies in avoiding both standard bombs and apple bombs while continuously moving to gather apples. The goal is to maximize your score before the ninja perishes from touching an explosive.", "Icy_Portals.js": "\"Icy Portals\" is a puzzle game where players navigate through levels to reach the goal by sliding on ice and using teleporters strategically. The game incorporates energy-control mechanics, requiring players to move within a limited number of moves. The challenge lies in navigating obstacles and utilizing teleporters to reach the goal efficiently.", "Infinite_Shooter.js": "Infinite Shooter is an endless shooting game where bad guys drop from the top of the screen at random speeds, progressively spawning more quickly over time. Players must shoot these bad guys to gain points, with faster enemies awarding higher scores. The game ends when a bad guy collides with the player.", "Invisible_Maze.js": "\"Invisible Maze\" is a logic game where players navigate through multiple levels with hidden paths. The challenge is to find the correct route while avoiding being misled by winding paths, with an added bonus of discovering an Easter egg in one of the levels. Will players be able to unveil the hidden paths and complete the game?", "It_Is_Coming_Out!.js": "\"It_Is_Coming_Out! is a game where the player eats food and navigates through obstacles to reach a toilet and poop, then proceeds through a door to advance to the next level. Levels increase in difficulty, requiring strategic movement to avoid and push blocks. The ultimate goal is to successfully poop and progress before time runs out.\"", "Jet_Box.js": "\"Jet_Box\" is a puzzle-score game where you control a jet and must reach a yellow square to blast it open, creating a path. You must do this before a green dot on the left reaches the top, indicating your proximity to a wall. If you fail to reach the open path in time, you crash.", "Juice_Clicker.js": "\"Juice Clicker\" is a casual idle game where players run a juice-making store by producing juice manually and acquiring auto juicers to increase production speed. Players must manage resources to purchase auto juicers, which incrementally boost juice output over time. The goal is to optimize juice production through strategic investments in automation.", "Jumper.js": "\"Jumper\" is an endless game focused on jumping over obstacles to improve reaction time and achieve a high score. Players navigate through a side-scrolling world where they must avoid hitting obstacles, as doing so decreases their lives. The game features a main menu, instructions, high scores, and gameplay within a simple blocky environment.", "Kalo.js": "\"Kalo\" is a fast-paced typing game where players input sequences of characters displayed on the screen. As the game progresses, the time allowed to input the sequences decreases, and the sequences become more complicated. The aim is to score as high as possible before making a mistake.", "Knight_Post.js": "\"Knight Post\" is a Sokoban-style puzzle game where you play as Sir Mailus Postus, a knight postman tasked with delivering mail. The objective is to push mail towards designated mats while strategically moving bookshelves to clear your path. Complete each level by delivering all the mail in this whimsical medieval adventure.", "L0st.js": "\"L0st\" is a maze-based puzzle game where players navigate through challenging levels to reach a goal while interacting with NPCs for hints and pushing obstacles out of the way. The theme revolves around escaping a corrupting force, adding a layer of urgency and narrative depth. This game was created as the author's first original project, with some helpful advice from their father.", "LUCK.js": "\"LUCK\" is a Sokoban-style puzzle game where players push boxes to cover goal tiles. The game features multiple levels, with increasingly complex layouts of walls, boxes, and goals. Players must strategically move to complete each level and progress to the next.", "Labyrinth.js": "Labyrinth is a simple maze game where the player navigates through a series of progressively challenging levels to find the exit. The game is inspired by Sokoban-style mechanics, and players must maneuver around walls to reach their goal. Created by DorukSarpAlwaysStrikesBack!, it was added on February 12, 2023.", "Labyrinth2.js": "Labyrinth2 is a Sokoban-style puzzle game where players navigate through a series of mazes to find the exit. It combines classic maze-solving with the challenge of maneuvering around obstacles. Navigate the player character to the end tile to progress through increasingly complex levels.", "Labyrinth3.js": "Labyrinth3 is a sokoban-style game where the goal is to navigate through a series of labyrinths and find the exit. As the final installment of a simple labyrinth series, players must maneuver the character through increasingly challenging mazes filled with obstacles. The game requires strategic movement and problem-solving to successfully reach the endpoint.", "LaserGuide.js": "\"LaserGuide\" is a puzzle game by Extner where players must rotate mirrors to direct a laser beam to the target. The game involves strategic placement and rotation of mirrors to navigate the laser through various obstacles and reach the goal. The challenge lies in manipulating the mirrors correctly to achieve a successful pathway for the laser.", "Lava_and_Water.js": "\"Lava and Water\" is a cooperative two-player puzzle game where players must work together to reach their respective teleporters before time runs out. Each player controls a character and must navigate through obstacles and avoid moving blocks into the teleporters. The game features multiple levels with increasing difficulty.", "Lava_the_impossible_maze.js": "\"Lava the Impossible Maze\" is a timer-based puzzle game inspired by the game \"Treasure Hunt.\" Players navigate a maze filled with obstacles and pushable boxes to reach the goal within a set time limit. Each level increases in difficulty, with new challenges and layouts to overcome.", "Let_Them_Eat_Cake.js": "\"Let_Them_Eat_Cake is a thematic puzzle game where the player pushes cakes to sad people to make them happy, then returns to the starting door to complete each level. The game emphasizes quick thinking and movement, resembling a speed-run experience without a timer. Created by high school student Xander Reyes, it challenges players through progressively complex puzzles.\"", "Limits.js": "Limits is a puzzle game where the player has a set number of moves to complete each level. Players navigate through the map using portals to teleport and collect coins to gain more moves, with a goal of reaching the finish. The game features a main menu, win screen, and level select screen.", "Linebeck-Land.js": "Linebeck Land is a simple platformer game that involves navigating through various levels to find multiple endings and hidden secrets. Players must collect tomatoes while avoiding deadly obstacles. The game features a traditional platforming experience with unique challenges and rewards for thorough exploration.", "LittleSpringGame.js": "\"Little Spring Game\" is a puzzle game where the player navigates through levels by moving boxes and destroying rocks to reach a house. The objective is to solve each level by strategically pushing objects and clearing obstacles. Created by Jonas Heilig, the game challenges the player's problem-solving skills in a pixelated environment.", "Lost-Alien.js": "Lost Alien is a maze game where players help a stranded alien navigate through different levels to find his way back to the ship. The game involves solving puzzles and overcoming obstacles, such as pushing crates and using portals, to progress through the mazes. Each level gets progressively challenging, requiring strategic thinking to reach the goal.", "Mad_city.js": "\"Mad_city\" is an endless runner game where players navigate a car through a chaotic city. The goal is to avoid obstacles such as cones, holes, and pedestrians to survive as long as possible.", "MagicalTiles.js": "MusicalTiles is a small music player game where each key press plays a unique tune. Using the WASD keys and others, players can create different musical notes and enjoy the resultant sounds. Inspired by Nomis by Cheru Berhanu and Music! by Akeell, this game highlights the joy of making music interactively.", "Mario_Kart.js": "Mario_Kart is an endless arcade game with a Mario theme where the player must jump to avoid incoming blocks. The goal is to jump over as many blocks as possible to achieve a higher score. The game continues until the player collides with a block, resulting in a game over.", "Mario_Platformer_v2.js": "Mario Platformer is a puzzle game where you guide Mario through various levels to collect stars and reach the goal. Navigate Mario using the keys A&D to move left and right, K to jump, and J to restart levels. Be prepared for puzzles that involve different types of blocks, some of which fall when you stand on them or can be pushed forward.", "Mastermind.js": "Mastermind is a logic-based, classic-style game where players attempt to deduce a hidden sequence of colors using limited feedback provided after each guess. Players adjust color and position selections to form their guesses, then receive hints to refine subsequent attempts. The goal is to identify the correct color sequence within a predefined number of tries.", "MathRacer.js": "MathRacer is an educational game where players solve math equations by collecting gems while driving along a road. The goal is to collect green and blue gems in a way that satisfies a given equation before the timer runs out. It combines quick reflexes with basic arithmetic to create an engaging and challenging experience.", "Maths_Speedrun.js": "Maths Speedrun is a logic-based game centered on quickly identifying whether a displayed equation uses addition or multiplication. Players must respond by pressing the appropriate key to indicate the operation. The game continues until an incorrect answer is given, at which point players can reset and try again.", "Maze_Escape.js": "Maze_Escape is a Sokoban-style puzzle game where a character navigates through a series of increasingly complex mazes. The objective is to reach the green flag in each of the 5 levels to advance and ultimately escape. The game tests your problem-solving skills and spatial awareness.", "Maze_Escape_Reach_The_Yellow_Box.js": "\"Escape the evil moving purple block\" is a maze game where you control a pumpkin character with the goal of reaching a yellow box to complete each level. Players must navigate through treacherous obstacles, including moving purple blocks, cannons, discs, and spikes, all while managing limited health and collecting health potions. This game offers a dynamic challenge as enemies and obstacles exhibit different movement patterns and damage levels.", "Maze_Runner3.js": "Maze_Runner3 is a Sokoban-style puzzle game where the player navigates through mazes to reach a goal. As levels progress, invisible obstacles are introduced that require players to find alternate paths. The simplicity in mechanics contrasts with the increasing complexity of mazes, challenging players' strategy and spatial awareness.", "Maze_with_coins_traps_enemies.js": "\"Maze with coins, traps, and enemies is a puzzle game where the player navigates through mazes to collect coins and reach the goal. The challenge lies in avoiding traps and moving enemies. The game features 7 progressively difficult levels, each requiring the player to gather all coins before reaching the endpoint.\"", "Mazerunner.js": "\"Another Maze Runner\" is a maze game with 10 levels where the objective is to reach the Crown while avoiding obstacles and solving simple puzzles. There are 3 different themes to choose from in the start menu. Players navigate through the maze, encountering various elements such as walls, keys, and enemies.", "Memory_Test.js": "Memory_Test is a simple memory game where players must remember and select tiles that were highlighted on a grid. Using directional input to move and a select button, players test their memory and try to beat their previous times. The game features an integrated timer and progressively challenging levels.", "Meteor_Dodge.js": "Meteor Dodge is an endless game where you control a green alien to avoid incoming meteors. The objective is to navigate the alien using WASD controls and survive for as long as possible without getting hit. The game was created by Kritav as their first project in JavaScript.", "Meteor_shower.js": "Meteorshower is a strategy game where the goal is to navigate a rocket to a coin while avoiding meteors. Players must carefully plan their moves to successfully reach the coin without colliding with the obstacles. The game offers increasing levels of difficulty and challenges the player's strategic thinking.", "MicroBot_Adventure.js": "MicroBot_Adventure is a puzzle game where you play as a robot navigating maze-like maps filled with enemies and obstacles. Your goal is to outmaneuver the enemies, strategically use boxes to block attacks, eliminate hostile turrets with lasers, and reach the portal to progress to the next level. The game challenges players to think tactically and plan their moves to avoid getting caught by enemy fire.", "Mind_game.js": "\"Mind_game\" is a logic-based game inspired by game theory concepts, particularly the Prisoner's Dilemma. The player learns and identifies patterns created by a computer opponent, and then strategically chooses when to cooperate or deflect to maximize their points. The goal is to outsmart the computer through strategic decision-making.", "Minigame-Mania.js": "Minigame-Mania is a strategy game where the player navigates through various levels filled with obstacles and lava. The goal is to reach the end of each level while avoiding deadly lava pits. The game features progressively challenging levels and is designed to test the player's problem-solving skills and reflexes.", "Mining_Simulator.js": "Mining_Simulator is a 2D simulation game that allows players to mine and place blocks within a customizable world. Players navigate through the terrain, using tools to dig and build, all while managing their resources and monitoring their progress. The game focuses on exploration and construction in a procedurally generated environment.", "Mirror_Mirror.js": "Mirror_Mirror is a Sokoban-style puzzle game where you must navigate a maze with a twist: you have a clone that mirrors your every move. The goal is to lead both characters to the exit simultaneously, requiring careful planning and coordination. If either character fails to reach the exit, you must restart the level.", "Mirror_Snake.js": "Mirror_Snake is a strategy game where the player controls a blue snake to eat apples and increase its score while avoiding collisions with walls or its mirrored counterpart, an orange snake. The player's movements are mirrored by the orange snake, making it challenging to navigate the space without causing a crash. The objective is to survive as long as possible and achieve a high score.", "Mom_have_you_seen_Coco.js": "\"Mom, Have You Seen Coco?\" is a hidden object game in which the player helps find a runaway cat named Coco in various chaotic scenes. The player navigates through different levels designed with intricate details to locate Coco hidden among other elements. The game focuses on observation and quick reflexes to spot and rescue Coco as quickly as possible.", "Monkey_Bannana.js": "\"Monkey Banana\" is a catching game where the player navigates through levels to collect bananas while avoiding monkeys and walls that can reduce scores. Throughout the game, players can also collect special power-ups for bonus points and temporary advantages. The game consists of multiple levels, each with increasing challenges and opportunities to achieve a higher score.", "Monkey_Catch_Food.js": "\"Monkey_Catch_Food\" is a game where you play as a monkey trying to catch falling fruits while avoiding bombs to increase your score and stay alive. There are various power-ups such as life fruits for extra lives and speed boosters to enhance gameplay. The objective is to catch as many fruits as possible without running out of lives.", "Monkey_Demolition.js": "Mirror_Mirror is a game where you play as a monkey on a rampage, tasked with destroying buildings in a city. The goal is to break 50 buildings to win. The theme centers on chaotic destruction and the challenge of maneuvering the monkey to effectively demolish structures.", "Monty_Hall.js": "Monty Hall is a simulation game where players choose one of three doors in hopes of finding a car behind it, while the other doors hide goats. After selecting a door, one of the remaining doors with a goat is revealed, and players are given the option to switch their choice. The game demonstrates the statistical advantage of switching choices to increase the chances of winning the car.", "Morph-Madness.js": "Morph-Madness is a puzzle game where you solve levels by switching between a player and a bat to maneuver blocks onto designated goals. Players can push blocks but cannot pass through walls, while bats can pass through anything but cannot push blocks. The challenge lies in strategically morphing between forms to conquer each level inspired by classic Sokoban mechanics.", "Morse_trainer.js": "\"Morse Trainer\" by Yuuta is an educational game designed to help users learn and practice international Morse code. It features two modes: one where users can translate text to Morse code and another where they can convert Morse code back to text. This game aims to make learning Morse code easier through an interactive flashcard-style system.", "Musi.js": "Musi is a memory game similar to Simon where players must recall and reproduce a 4-note melody instead of a sequence of colors. Players use specific keys to play different notes and receive auditory feedback on their correctness. The game progresses by increasing the complexity of melodies as the player successfully repeats them.", "Music!.js": "\"Music!\" is a simple and fun music-making game where players move their character to different colored blocks to play notes. Bright colors represent higher-pitched notes, while gray colors represent the same notes in lower pitches. The colorful pink and purple blocks trigger pre-written songs created by the developer.", "MusicGarden.js": "\"Music Garden\" is a game where players create a musical garden by planting and growing different types of flowers, each corresponding to a musical note. Players can interact with the garden using a variety of tools, including a shovel to remove flowers, a water drop to grow seeds into flowers, and a black cat to clear the field. The objective is to arrange the flowers to compose different tunes.", "MyForestMaze.js": "MyForestMaze is an exploration game where players navigate through a simple maze set in a forest environment. The game serves as a test of various JavaScript functionalities while challenging players to find a secret within the maze. Each level offers a unique layout and subtle hints to guide players toward the next stage.", "Nickels.js": "Nickels is a digital strategy dice game by Adam Miller where players compete to fill a board by covering tiles with nickels. Players roll dice to determine which tiles to cover, with opportunities to steal covered tiles from opponents and reroll on doubles. The first player to cover all ten board spaces wins the game against the computer opponent.", "Nim.js": "Nim is a classic strategy game where players take turns removing matches from a pile, aiming not to take the last one. The goal is to force your opponent into a position where they must take the final match. The game requires strategic planning and foresight to outmaneuver your opponent.", "Ninja_In_A_Bear_Trap_Factory.js": "\"Ninja In A Bear Trap Factory\" is a strategy game where you guide a ninja through a factory filled with bear traps. Collect swords to disable traps blocking your path and reach the goal to progress through increasingly challenging levels. Avoid traps and use your strategy skills to navigate safely.", "Number_Nudger.js": "Number_Nudger is a strategic puzzle game where players guide blue number blocks into green slots by controlling a red player, all while avoiding various obstacles. Each level requires players to carefully nudge the blocks into place without getting them stuck. The game offers multiple levels, increasing in difficulty as players progress.", "Operation_Ocean.js": "Operation_Ocean is a strategy game centered around reducing CO2 emissions to help alleviate ocean acidification. Players shoot CO2 bubbles to gain points, and every 20 points, the in-game environment changes to reflect improvements in ocean health. The ultimate objective is to reach 120 points and save the ocean from damage.", "OrderTheKitchen.js": "\"Order the Kitchen!\" is a casual endless game where you manage a restaurant by organizing incoming dishes, placing them next to similar items to maintain order. Keep your cool and see how many rounds you can last as the pace picks up. The challenge is to strategically manage space and ensure no mismatched items break the sequence.", "Orpheus_Burger_Dash.js": "Orpheus Burger Dash is a fast-paced game where the player must assemble a burger by catching ingredients that fall from the top of the screen. The player starts with bread and must catch meat, cheese, tomato, and lettuce in order while avoiding rotten eggs. The game's difficulty increases every three points as the falling ingredients speed up.", "PASS_ALL.js": "PASS_ALL is a strategy game where the objective is to cover all the tiles on a grid without retracing your steps. The player navigates around blockers and carefully plans each move to ensure no tile is left uncovered. Winning requires strategy and foresight to successfully complete each increasingly challenging level.", "Pac-Man_But_With_Stars.js": "\"Pac-Man But With Stars\" is a classic strategy game where Pac-Man must collect all the stars for his collection while avoiding spooky ghosts that can phase through walls. Navigate through various levels, each posing unique challenges, to outsmart the ghosts and achieve your goal. The game brings a refreshing twist to the traditional Pac-Man experience with its star-collecting objective.", "Pac_Man.js": "This game is a classic recreation of Pac-Man where players control Pac-Man to navigate a maze, eat all the dots to win while avoiding ghosts with varying AI behaviors. Eating power pellets allows Pac-Man to temporarily turn the tables and eat the ghosts for extra points. The game concludes when all dots are consumed or if Pac-Man loses all his lives to the ghosts.", "Paint_IT.js": "\"Paint_IT\" is a sandbox game where the objective is to create art using different colors on a blank canvas. Players can move their virtual brush and switch between black, red, blue, and yellow to create unique designs. The game encourages creativity and sharing your artwork with the community.", "Party_Games.js": "\"Party Games\" is a multiplayer game designed to be played in person by passing the console around. The current game mode, SPY, involves players trying to guess a common word while one or more spies attempt to blend in and figure out the word themselves. Each turn, players reveal related words until the spy makes a guess or the timer runs out.", "Path_Master.js": "\"Path Master\" is a puzzle game inspired by Sokoban where players navigate through intricate levels to push boxes onto goals while avoiding enemies and obstacles. Touching an enemy causes you to restart the level, adding an extra layer of challenge. The game incorporates portals, keys, and locks to enhance its complexity and engagement.", "PennyPlatformer.js": "\"Penny Platformer\" is a platformer game with three levels featuring the Penny's Big Breakaway asset pack. Players control Penny as she navigates various terrains, collecting coins and avoiding penguins. The game incorporates elements such as jumping and strategic movements to successfully complete each level.", "Penny_s_Quest.js": "\"Penny's Quest\" is a roguelike game where players explore randomly generated levels, using a yoyo to battle penguins and eventually face a final boss. Every few levels, players can visit a shop to buy items or receive a free item from a prize room. The gameplay involves strategic movement, combat, and resource management to progress through increasingly difficult challenges.", "Pet_the_Cat.js": "\"Pet the Cat\" is a simple game where the main objective is to pet a cat. The player interacts with the game using specific keys to pet the cat and keep track of the number of pats. The game's theme revolves around a love for pets, specifically cats.", "Phil_Tom_Bug.js": "\"Phil_Tom_Bug\" is a puzzle and adventure game that follows the life of Phil Tom Bug, from his early years to the end of his life. Players help Phil navigate through multiple levels, moving push boxes and avoiding other bugs, in a quest to reunite with his mom. The game features various challenges such as keys, locks, portals, and traps.", "Physics_Sandbox.js": "\"Physics Sandbox\" is a simulation game demonstrating physics using Verlet Integration. Players can create, manipulate, and link objects in an environment where they can adjust settings such as gravity and drag to observe various physical behaviors. The game offers a rich set of options to experiment with physics principles dynamically.", "Piano.js": "\"Piano\" is a simple simulation game where players control an arrow to select piano keys and play notes. The arrow is moved left and right using A and D, and the currently selected note is played by pressing W. This game, created by Scott, is focused on providing a fun, piano-playing experience.", "Ping-Pong.js": "\"Ping Pong\" is a classic-style game where players score points by getting the ball past their opponent's paddle. The left paddle is player-controlled, while the right paddle is controlled by an AI that follows the ball's vertical position. The game resets the ball to the center after each score, and the score is displayed at the top of the screen.", "Pixel_Peril.js": "\"Pixel Peril\" is a maze-based game where players control a blue ghost navigating through spooky mazes while being chased by a red ghost. The objective is to collect a coin and escape to the next level while avoiding dead ends, spikes, and corners. Each level presents new challenges as the player progresses through increasingly difficult mazes.", "Pluffy_The_Cage_Bird.js": "\"Pluffy_The_Cage_Bird\" is a timer-based puzzle game where you guide a bird named Pluffy through various challenges to reach its home, which is a cage. Inspired by the \"Flurffy Game,\" players navigate through increasingly difficult levels filled with obstacles. The objective is to overcome these challenges within a set time limit to advance to the next level.", "Pocketnaut_Adventure.js": "\"Pockenmaut Adventures I\" is a space-themed adventure game where players guide Pocketnaut in his quest to reach his spaceship and return to Earth to save the planet. Players navigate through various levels filled with obstacles, including space lava and walls, using a jetpack to move up, down, left, and right. The game features multiple levels, each with increasing complexity and hazards, to challenge players' skills.", "Poisonous-Snake.js": "\"Poisonous Snake\" is a twist on the classic Snake game, where players must avoid poisonous apples while eating healthy ones to grow. As the snake consumes more apples, the game speed increases, challenging players' reflexes and control. The goal is to survive as long as possible without hitting the snake's own tail, the borders, or consuming a poisonous apple.", "Protect_The_Surfer.js": "\"Protect The Surfer\" is an engaging game where players control a surfer trying to navigate dangerous waters filled with sharks while aiming to reach the shore safely. The primary objective is to avoid deadly shark attacks and earn points by successfully crossing the screen. As players progress, they can collect power-ups and strive to achieve the highest score possible.", "PushBattle.js": "PushBattle is a multiplayer game where two players compete to push each other into hazard blocks to win rounds. The game tracks rounds and victories for each player, allowing for unlimited play. The objective is to strategically maneuver and push the opponent into dangerous areas on the map.", "Push_The_Box.js": "\"Push_The_Box is a Sokoban-style puzzle game where players push boxes onto buttons to progress through levels. Avoid spikes that reset your progress and use togglable walls to navigate the 15 challenging levels. Each completed level advances you to a more complex puzzle, testing your strategy and problem-solving skills.\"", "Puzzle_Game.js": "\"Puzzle_Game\" is a timer-based puzzle game where the player navigates through levels to reach the goal while solving spatial challenges. The game involves pushing boxes and other objects to clear a path to the target within a limited time.", "QuadraPedal.js": "\"QuadraPedal\" is a sokoban-style puzzle game where you control four characters simultaneously to push purple boxes onto green goals. Each level challenges the player to strategize movements across different terrains and obstacles. Players must edit the code to solve puzzles and can even create their own game mechanics for a personalized experience.", "Quest_to_Heaven.js": "\"Quest_to_Heaven\" is a puzzle game where you play as an angel trapped in a dark place and must escape by finding keys and avoiding demons and other entities. Navigate through various levels filled with traps and locks to reach the exit and progress further. The game challenges your strategy skills to overcome obstacles and escape to freedom.", "RIFT_JUMP.js": "\"Rift Jump is a challenging platformer where players navigate levels to collect coins and reach a portal to progress. The game features various obstacles and moving platforms that require precise timing and skill to overcome. Ideal for fans of coin-collecting and platformer genres.\"", "ROOM.js": "ROOM is a DOOM-inspired 3D shooter where players are trapped in a confined room and must survive as long as possible. Health slowly drains over time, necessitating the collection of medkits, while avoiding enemies. The challenge intensifies with the appearance of more enemies and environmental hazards.", "RR_Run.js": "\"RR Run\" is a puzzle game where players navigate their avatar through various levels to reach the 'RR' goal and progress. Players must avoid bombs, move boxes, and collect keys to unlock paths while dealing with challenging obstacles. The aim is to successfully move the character to the end of each level until reaching the end screen.", "Raincatch.js": "\"Raincatch\" is a simple arcade game where players use a bucket to catch raindrops falling from the sky. The goal is to collect as many raindrops as possible to increase the score. It has a lighthearted theme focused on the necessity of catching rain to stay hydrated.", "RandomDungeon-final.js": "RandomDungeon is a treasure-hunting game where you dig through walls and battle enemies to collect as much gold as possible before you perish. Throughout the game, you'll encounter and fight various enemies while searching for better weapons and treasure in randomly generated dungeons. The objective is to accumulate gold and survive as long as possible.", "Recycling_Turtle.js": "Recycling Turtle is an educational puzzle game that teaches players about proper plastic disposal. Players control a turtle moving left and right to catch recyclables and avoid nonrecyclables, earning and losing points respectively. The goal is to reach 100 points to become a Master Recycler, while learning the recycling status of various plastic types.", "Robot_Party_Basic_Buildv1.js": "\"Robot_Party | Basic Build v1\" is a puzzle game where players control a robot named John to push boxes and collect coins. The goal is to reach the designated point by strategically moving boxes while navigating various obstacles within different levels. Occasionally, players might discover a secret level, featuring special music and a unique ending.", "Rock_Paper_Scissors.js": "\"Rock, Paper, Scissors! is a classic strategy game where players choose between rock, paper, or scissors to compete against an AI opponent. The game involves moving your selection with 'W' and 'S' keys and confirming with 'J' to see the outcome. It's simple, nostalgic, and a fun test of your guessing skills against a virtual foe.\"", "Rolling_Obstacles.js": "Rolling Obstacles is a puzzle-score game where the objective is to navigate a ball to collect coins while avoiding obstacles. Players must gather 15 coins to win, but they cannot pass through any obstacles in their path. The game was developed by Ruhan Pandit and features random coin placements that add to the challenge.", "RougeColors.js": "\"RougeColors\" is a strategy game where the objective is to defeat enemies by matching their color. Players must navigate through levels, changing their color by walking over specific tiles. Victory is achieved by eliminating all enemies that match the player's current color.", "Runaway.js": "Runaway is a suspenseful game where you must evade a friendly ghost that inadvertently scares you to death due to its overwhelming power. Your goal is to navigate through various levels, avoiding randomly teleporting ghosts and deadly landmines, to reach the exit door. The tension is amplified by the ghost's unpredictable movements, adding a thrilling element to each escape.", "Rythym.js": "\"Rythym\" is a rhythm game where players must use the WASD keys to activate corresponding pads as arrows descend the screen. Timing is crucial, as missing an arrow or activating a pad without an arrow on it results in a loss of points. The game challenges players to maintain accuracy and rhythm to achieve high scores.", "Rythym_Mania.js": "\"Rythm-Mania\" is a fun rhythm game where the goal is to hit the correct keys (A, S, D, J, K, L) when falling notes align with the blocks on the screen. The game features six levels with different note patterns, and a random mode for an unpredictable challenge. Players can select levels from a menu, with each level offering a unique musical experience.", "SOS_Game.js": "SOS_Game is a multiplayer game where players take turns placing letters to form the word \"SOS\" horizontally, vertically, or diagonally on the game board. The game continues until the board is full, and the player with the most completed SOS sequences wins. The final score is displayed with the total number of SOS sequences created by each player.", "Save-the-flower.js": "\"Save-The-Flower\" is a strategy game where you drive a firetruck to protect a flower located in the middle of the screen. Fires approach from two corners, and you must extinguish them before they reach the flower. The challenge intensifies over time as the speed of the fires increases and walls begin to obstruct your path.", "Simon-WASD_Edition.js": "\"Simon-WASD_Edition\" is a pattern-matching game where players must memorize and replicate sequences of colors using the W, A, S, and D keys. Each successful round adds a new color to the existing pattern, challenging the player's memory. The objective is to achieve the highest score possible by accurately following the growing sequence.", "Simple_Jump_And_Run.js": "\"Little jump and run game\" by Vincent Abeln is a platformer where you navigate through levels to collect coins and reach the finish line. Players can spawn clouds for added mobility, helping them traverse challenging terrains and obstacles. Progress through levels by mastering jumps and strategically placing clouds to aid your journey.", "Slap-A-Fish.js": "\"Slap-a-Fish\" is a fast-paced reaction game where the objective is to slap fish as quickly as possible when they appear on the screen. The faster you respond, the more points you earn. The game features different types of fish, including rare ones that yield higher points.", "Slimer.js": "\"Slimer\" is a puzzle game where you navigate through various levels using keys, blocks, and other interactive items to reach the end goal. Players must solve obstacles by moving crates, collecting keys, and avoiding barriers. The game features progressively challenging levels, each requiring strategic thinking to complete.", "Snake.js": "\"Snake\" is a classic endless game where players control a snake to eat food and grow longer. The game features a score system, progressive speed increase, and a restart option. It was created by Boyne Gregg for the Sprig console.", "Snake_4_2.js": "\"Snake_4_2\" is an endless Snake game featuring both singleplayer and multiplayer modes. In singleplayer, the snake moves only with keypresses, while in multiplayer, two players compete head-to-head, collecting apples to grow and trying to outmaneuver each other based on slither.io death rules. Stephen King, the author, last updated the game on November 18, 2022.", "Snake_Boxes.js": "\"Snake_Boxes\" is a variation of the classic snake game where the goal is to push boxes to designated goals instead of eating apples. The snake continuously moves and you must navigate it carefully to align the boxes with the goals, avoiding collisions with walls or itself. The game is inspired by a special mode in the Google Snake game and challenges players to score points by strategically positioning the boxes.", "Snowman_Escape.js": "\"Snowman_Escape\" is a puzzle game where you guide a snowman to reach the goal in each level. Navigate through obstacles, push rocks to cover blue circles, and avoid deadly lasers. The game challenges players with increasingly difficult puzzles as they progress.", "Solstice_game.js": "\"Solstice_game\" is a maze game in which you play as a sun collecting treasures by pushing boxes and navigating past mountains and enemy creatures called vaselings that can steal your treasure. The game involves solving puzzles to reach the goal at the end of each level, with the final display showing the number of treasures collected. This game was developed as an example for a Hack Club day of service.", "Sort.js": "\"Sort\" is a fast-paced, time-limited game where players must sort images to the left or right within 60 seconds. Players gain points for correct sorting and have only 3 lives to keep their streak going. The player with the highest score is the winner.", "Sound_Memory.js": "\"Sound Memory\" is a memory-based game where players listen to tunes in a specific sequence and then reproduce the sequence by pressing corresponding keys. Each key is associated with a different color and sound: W for red, A for yellow, S for green, and D for blue. The objective is to correctly repeat the sequence of sounds and colors to advance to the next round.", "Space-war.js": "\"Space War\" is a fast-paced action game where players control a spaceship, dodging enemy ships and using laser beams to destroy them. Players aim to achieve the highest score possible by surviving and eliminating as many enemies as they can. The game features dynamic enemy movements, explosion animations, and background music to enhance the experience.", "Space_Invaders.js": "OG Space Invaders, created by Atharva Malik, is a classic arcade-style shooter game inspired by the original Space Invaders. Players control a spaceship at the bottom of the screen, shooting upwards to destroy waves of enemy invaders. The goal is to clear all enemies while avoiding incoming enemy fire.", "Space_Invasion.js": "Space Invasion is an endless action game where players must fend off waves of approaching enemy spacecraft using a combination of movement and shooting. The game tests your survival skills as you control a ship, move left or right, and shoot to destroy enemies. Created with zero experience in JS, the game features a mix of simple controls and increasing challenge levels as players progress.", "Space_Odyssey.js": "Space_Odyssey is a dodge game where players navigate a spaceship through a field of asteroids, avoiding collisions with obstacles from the top and bottom of the screen. The game tests players' reflexes and timing as they strive to survive as long as possible.", "Space_Race_v1.js": "Space Race v1 is a multiplayer game where two players pilot spaceships through falling gates while collecting powerups and avoiding asteroids. Powerups can increase lives or temporarily stun opponents, and the gates' speed increases over time. The game ends when one player loses all their lives, declaring the other as the winner.", "Spike_Avoider.js": "Spike_Avoider is an endless runner game where the player's objective is to avoid hitting spikes. Players move the character up, down, left, and right to dodge obstacles and keep the game running for as long as possible. The game increases in difficulty over time, challenging players to survive as long as they can.", "SprazeJS.js": "\"Spraze\" is a logic-based maze game where the player navigates through various levels to reach the goal. Each level presents unique challenges, including movable obstacles and invisible walls, making some levels particularly difficult. Notably, the third level is considered the hardest by the creator.", "SpriMons.js": "\"SpriMons\" is an adventure RPG game set in Hack Club's Arcade event. Players take on the role of a Hack Club member who must save the event by collecting tickets to awaken Hakkuun, the key character preventing the event from continuing due to a deep sleep. Players also train their SpriMon creatures, defeat wild ones, and aim to become the best SpriMon trainer in the Hack Club.", "Spridle.js": "Spridle is a Wordle-inspired game where players guess a sequence of five numbers instead of letters. After each guess, green and red boxes indicate which numbers are correct and in the correct position. The game focuses on logic and pattern recognition to deduce the correct number sequence.", "SprigAlarm.js": "SprigAlarm is a utility game designed to help users wake up in the morning by keeping track of time and sounding an alarm if configured. Users can set and manage the alarm through a menu interface and must complete a memorization test to disable the alarm when it goes off. The game provides visual time display and auditory alerts to ensure users stay on schedule.", "SprigClick.js": "SprigClick is a simple endless clicker game where players aim to achieve higher scores through clicking and upgrading. Players can earn money by clicking, then use that money to enhance their money per click (MPC) and activate or improve an autoclicker function. The game's focus is on incremental progress and upgrades.", "SprigDungeons.js": "\"Sprig Dungeons,\" created by Mirrek, is an adventure game where players delve into dungeons to kill enemies, collect weapons and potions, and challenge bosses. The game emphasizes exploration, combat, and strategic resource management in progressing through different dungeon levels. The objective is to conquer the depths of procedurally generated dungeons while upgrading gear and abilities to face increasingly difficult challenges.", "Sprig_Boy.js": "SprigBoy is a puzzle platformer where you play as a lonely boy trying to obtain a trophy for his parents. Inspired by Nintendo's BoxBoy!, the game features a unique play style where players can create boxes to their left and right to overcome various challenges and puzzles. Navigate through different levels to reach the trophy while dealing with obstacles and gravity.", "Sprig_Fighter.js": "\"Sprig_Fighter\" is a brutal two-player fighting game where players use fists to deplete their opponent's health until one emerges victorious. Each player moves left and right to dodge attacks and attempts to land hits on their adversary. The game resets automatically after a player loses all their health points.", "SprigbattleShip.js": "SprigbattleShip is a digital adaptation of the classic board game Battleship, featuring a 10x10 grid where players strategically place ships and attempt to sink the opposing fleet. Players use specific keys to move their cursor, place their ships, and launch attacks on the enemy grid while avoiding return fire. This version requires a strategic placement of 17 ships and includes both player and computer turns.", "Sprigenstein3D.js": "Sprigenstein3D is a maze navigation game where the objective is to escape 3D mazes by finding and reaching a trophy at each level's endpoint. Players navigate through mazes, collect keys to unlock doors, and avoid obstacles. Each level presents new challenges as you progress through increasingly complex maze designs.", "Spriggly_Jump.js": "Spriggly Jump is a whimsical platformer game where players, as spriggly, hop on clouds to navigate through the sky and reach the sun. Utilizing strategic movement and interacting with different types of clouds, players must plan their jumps carefully to avoid falling into the vast nothingness. The game challenges players with a limited number of moves while introducing unique mechanics like \"light\" clouds that reset movement counts.", "Sprigressbar.js": "The game \"Sprigressbar\" is inspired by Progressbar95. Players aim to fill their progress bar with blue or orange segments while avoiding red segments and closing annoying mascots on-screen. Each level completed earns points for blue segments, and players must use WASD to move the bar and IJKL to move the cursor to manage these elements.", "SquidsInTheStars.js": "\"SquidsInTheStars\" is a space-themed game where players must defeat evil squids. It is an endless game that progressively gets harder, with the score tracked by the number of squids defeated. The main objective is to survive as long as possible while eliminating enemies.", "Squilium_Escape.js": "Squilium_Escape is a puzzle game where the objective is to navigate multiple players to target destinations marked as 'X'. Players can push crates to clear paths but are blocked by walls or multiple crates. Each level is won when all players stand on their respective X targets.", "StickRunner.js": "StickRunner is a logic-based jumping game where a stick figure attempts to avoid obstacles and achieve the highest score. The player must press W to make the stick figure jump over various trees that appear randomly. The objective is to survive as long as possible without hitting any obstacles.", "Stickman.js": "Stickman is a simple game where the player navigates through levels to collect diamonds. The objective is to avoid enemies and obstacles while making use of portals for teleportation. The game progresses through a series of increasingly challenging levels, culminating in a win upon collecting the final diamond.", "Stop.js": "\"Stop\" is a puzzle game where you navigate a character towards waypoints, while encountering obstacles that aim to halt your progress. The game creates a sense of tension as it actively impedes your movement, challenging you to find ways to overcome various barriers. The objective is to reach designated waypoints on each level despite the game's attempts to stop you.", "Street_Racer.js": "Street Racer is a simple 90s-style racing game where players race their cars on a highway. The main objective is to navigate and dodge obstacles as the game progresses. Players move using the \"a\" and \"d\" keys to avoid collisions with other cars on the road.", "Super_Efficient_Bunny.js": "Super Efficient Bunny is a game where you must navigate a bunny to a carrot in the fewest steps possible. Each successful retrieval of a carrot advances you to the next level, and the challenge is to achieve the highest level within 400 steps. The game tests your strategic thinking and efficiency in movement as you guide the bunny through various levels.", "Super_Hard_Puzzle_challenges.js": "\"Super_Hard_Puzzle_challenges\" by Ruihan Cao is a challenging puzzle game where players must push a gold box onto a designated goal spot to progress through levels. The game incorporates strategic movement and offers hints at the cost of in-game currency, requiring thoughtful planning and problem-solving skills. Players can earn gold by successfully completing levels and use it to get hints or reset levels if needed.", "Super_Mario.js": "\"Super_Mario,\" created by Cosmin, is a classic-style platformer where players navigate levels, reaching pipes to progress further. The game features familiar elements like mystery boxes, enemies, and power-ups such as mushrooms. It's a retro-inspired adventure reminiscent of traditional Mario games.", "Super_Maze.js": "\"Super Maze\" is a strategy game where players must navigate through increasingly difficult mazes to reach the goal. Each level introduces new tile types that present unique challenges, such as directional tiles and teleporters. Avoid hazards like lava and use your wits to solve all six levels.", "Super_Platformer.js": "Super_Platformer is a fun and engaging game where players navigate through maps filled with obstacles, with the primary objective of reaching the red flag to complete each level. The game emphasizes strategy, requiring players to cleverly move boxes to overcome certain challenges. It provides an enjoyable platforming experience with increasing difficulty across its levels.", "Sus_Runner.js": "Sus_Runner is an endless runner game inspired by the Chrome Dino game, where you control an Among Us character. The player must avoid obstacles by jumping over them to survive as long as possible. The game tracks your score based on the distance you run.", "Swapper.js": "Swapper is a simple puzzle game featuring a swapping mechanic, allowing one or two players to navigate various levels. Players control characters to interact with buttons, portals, and boxes to open doors and solve puzzles. The goal is to reach specific points on each level, progressing through an introductory adventure in Sprig game development.", "Tag.js": "\"Tag\" by ThomasJPrice is a two-player game where one player, represented by the blue character, must \"tag\" or touch the red character, then the roles switch. The red player can navigate through the boxes for easier escape, while the blue player cannot collide with them. The game progresses through levels with varied obstacles and moving elements.", "Temple.js": "\"Temple\" is a puzzle game where players explore various levels of a temple, collecting diamonds to increase their value and navigating through waypoints to progress. Players must also avoid corrupt tiles that reset their value. The game's goal is to reach the treasure room, solving challenges along the way.", "Terminal-Dungeon.js": "\"Terminal-Dungeon\" is a puzzle-adventure game where players learn to use the Linux command line while navigating through a dungeon and interacting with Tux the Linux Penguin. The objective is to solve command-line puzzles to escape the dungeon. It is designed to be an educational yet straightforward experience.", "The-Two-Bananas-Game.js": "\"The Two Bananas Game, created by Sridhar, is a competitive game where two bananas face off in various minigames aiming for victory. Players can race to the finish, avoid lava, play soccer, and even wrestle each other off the edge. The game is designed for two players and can be played on both PCs and consoles, offering different controls for each.\"", "TheCombine.js": "\"The Combine\" is an adaptation of Kesey's \"One Flew Over the Cuckoo's Nest\" where players take on the role of McMurphy to escape the ward in the first module and then enjoy a fishing activity in the second module. The first module involves using strength to push blocks, breaking into a nurse's room to steal a key, and reaching a checkpoint, while the second module is a timed fishing game requiring players to catch fish within 60 seconds. This game offers a mix of puzzle-solving and casual gameplay.", "TheLostPenguin.js": "\"The Lost Penguin\" is a puzzle and maze game where players guide a penguin through an icy labyrinth filled with traps, puzzles, and barriers. Players must push rocks, disable force walls, teleport, and avoid spikes in their quest to find the exit. Collecting keys and unlocking gates are also essential to progressing through the levels.", "TheMazeGame.js": "\"TheMazeGame\" is a thrilling maze navigation game where players must find their way to the exit while being hunted by monsters. Players have limited vision and must skillfully use a flash to temporarily stun the monsters and evade capture. With multiple levels to beat, each introducing new challenges and more difficult enemies, it tests players' strategic and quick-thinking abilities.", "TheSpaceGuardian.js": "TheSpaceGuardian is a fast-paced shooting game where players take control of a spaceship to defend against waves of invading UFOs with lasers. Different types of UFOs, including fast and shooting varieties, as well as a powerful boss, appear as the game progresses. Power-ups and special ammo provide temporary advantages, adding strategic elements to the gameplay.", "TheTombOfAThousandTerrors.js": "\"The Tomb of a Thousand (T)errors\" is a maze game where players navigate through increasingly complex, randomly generated labyrinths. The objective is to collect keys to open passages and gather diamonds while exploring new depths. Initially aimed as a Zelda-like game, it evolved into a pure maze challenge that could be a foundation for a more complex game.", "The_Bird_Feedo.js": "The Bird Feedo is an endless game where players feed randomly generated cookies to a cute little bird. Navigate the bird using directional controls to collect cookies and keep the game going. The objective is to last as long as possible without missing cookies.", "The_Legend_Of_Sprig.js": "The Legend Of Sprig is an adventurous, action-packed maze game where you play as Marin, a treasure hunter armed with a sword and shield. Your mission is to traverse Sprig's intricate labyrinth, filled with 68 rooms, fierce enemies, and hidden treasures. Collect keys to unlock doors, gather pumpkins, and fight off enemies to ultimately find Sprig's legendary treasure.", "The_Legend_of_Zelda-Links_Escape.js": "The Legend of Zelda - Link's Escape is an advanced side-scrolling game where the player controls Link as he tries to escape from various enemies through a dynamically changing environment. The gameplay involves dodging obstacles, jumping, and defeating enemies like Moblins and Lynels while collecting points. The game features unique pixel art for characters and background elements, creating an immersive adventure for fans of the classic Zelda series.", "The_Maze_of_Sprig.js": "\"The Maze of Sprig is a Sokoban-style puzzle game where players navigate mazes to reach a green teleporter. The game features several levels with different obstacles and allows players to add their own maps. It's designed to be a fun and engaging way to pass the time when you might be away from your computer.\"", "The_Pet.js": "\"The Pet\" is a simulation game where players care for and feed a creature as it evolves from an egg to various life stages. The player's actions influence the pet's development and its eventual fate. This game emphasizes nurturing and observing the lifecycle of a virtual pet.", "The_Real_Football.js": "The Real Football is a nostalgic football game inspired by the classic games found on old keypad phones, with a 90's vibe. Similar to Sokoban, players must juggle the football, avoiding hurdles as they navigate towards the goal. The game combines puzzle elements with vintage soccer gameplay for a unique challenge.", "The_Sky_Is_Falling_For_Real_This_Time.js": "\"The Sky Is Falling For Real This Time\" is an endless avoidance game where the player must dodge falling clouds to achieve a high score. The challenge intensifies as the speed increases, demanding quick reflexes and strategic movement.", "The_Story_of_Grass.js": "The Story of Grass is a puzzle game where players evolve from a lawnmower to various other forms like a cow, car, milk carton, and shopping cart through different levels. Each level presents unique challenges such as mowing grass without touching flowers, eating grass as a cow, and delivering milk. Navigate through these tasks to progress and ultimately get the shopping cart to the cashier.", "The_UFO_farm.js": "\"The UFO Farm\" is an endless game where you harvest as many crops as possible while avoiding UFOs that become more numerous and active with each harvest. The objective is to collect crops while strategically evading the growing number of UFOs to achieve a high score before getting caught.", "The_impossible_game_l1.js": "\"The Impossible Game is an extremely challenging puzzle platformer inspired by the classic Flash game of the same name. Players navigate through various levels filled with moving obstacles, attempting to reach the end goal. The game's difficulty level is designed to be nearly unbeatable, adding to its appeal.\"", "Tic-Tac-No.js": "Tic-Tac-No is a multiplayer twist on the classic Tic-Tac-Toe game where both players use Xs, but the goal is to prevent forming a row of three Xs. Players take turns placing their Xs, and the player who completes a triple X loses. This innovative game introduces a strategic challenge where the winner gets to avoid the dreaded \"triple X\" and claim victory.", "Tic-Tac-Toe-YZ.js": "Tic-Tac-Toe is a strategic twist on the classic game where players aim to align three of their marks in a row to win, either horizontally, vertically, or diagonally. You play as 'Y' against an AI opponent represented by 'Z'. The game includes unique power-ups that can modify gameplay by offering advantages such as making the AI lose a turn or allowing extra moves.", "Tic-Tac-Toe.js": "Tic-Tac-Toe is a classic two-player game where participants take turns marking spaces in a 3x3 grid with either an X or an O. The objective is to align three of your marks horizontally, vertically, or diagonally before your opponent does. The game ends when one player wins or when all spaces are filled, resulting in a tie.", "TicTacToe2.js": "\"TicTacToe\" is a digital version of the classic two-player game where players take turns to place their symbol (X or O) on a 3x3 grid, aiming to align three of their symbols in a row vertically, horizontally, or diagonally. The game ends when one player achieves this or when the board is fully occupied, resulting in a draw.", "Tic_Tac_GPT.js": "TicTacGPT is a basic Tic Tac Toe game featuring a single-player mode against a low-level AI opponent. It builds upon the code from Northernside and introduces some new elements and bugs. The game plans to include multiple difficulty levels in future updates.", "Tic_Tac_Toe.js": "TicTacToe is a classic two-player game where participants take turns marking spaces in a 3×3 grid with X or O, aiming to align three of their symbols horizontally, vertically, or diagonally to win. This version builds upon the work of Atharv Gupta with enhancements and bug fixes. The game ends when a player wins or all spaces are filled, resulting in a tie.", "Tile_Slider.js": "\"Tile Slider\" is a puzzle game centered around rearranging tiles to form a complete picture, which in this case is a gift. Players use the arrow keys to move tiles, with the goal of restoring the jumbled image to its original form after shuffling. The game challenges spatial reasoning and memory.", "Top_Hat_Turtles.js": "Top Hat Turtles is a cooperative multiplayer game where two players each control a turtle and work together to guide them to their respective totems. Each turtle's top hat color matches its goal totem, and the players must navigate progressively challenging levels to progress. The game emphasizes coordination and teamwork.", "Traditional_Snake.js": "\"Traditional Snake is a classic game where players control a snake to eat apples, growing in length with each apple consumed. The objective is to avoid hitting the walls or the snake's own body. It offers a nostalgic challenge for fans of retro gaming.\"", "Trash_IT.js": "\"Trash_IT\" is a strategy game where players aim to delete files by dragging folders to the trash while avoiding hazards like skulls. The game gets progressively more confusing as you advance through the levels, and players have options to activate magic and play music.", "Treasure-Hunt-Adventure.js": "Treasure-Hunt-Adventure is a puzzle game where the player, as a pirate, navigates through jungles and beaches to transport a gem to their ship. Players must strategically move boxes and overcome obstacles to ensure the gem reaches the ship. The theme revolves around exploration and treasure hunting, adding a whimsical and adventurous touch to solving puzzles.", "Treasure_Hunt.js": "Treasure_Hunt is a strategic puzzle game where players navigate a character through various levels, pushing boxes and avoiding obstacles to reach hidden treasures. The game challenges players to think critically and plan their moves carefully to succeed. It emphasizes strategy and problem-solving within a fun and interactive environment.", "Tretris.js": "\"Tretris, created by Xander K., is a block-stacking game where players aim to clear horizontal lines to earn points while preventing the blocks from reaching the top. The game features different block shapes that must be strategically rotated and placed. It includes options to select starting levels and background music for an enhanced gameplay experience.\"", "Tron.js": "\"Tron\" is a multiplayer game adaptation based on the classic light cycle battles from the movie Tron. Players compete to outmaneuver each other by creating light trails that opponents must avoid. The game ends when a player crashes into a trail or a wall, declaring the other player as the winner.", "TwinPrimeRockets.js": "TwinPrimeRockets is a thematic puzzle game centered around recognizing twin prime numbers. Players decide if both given numbers are prime by pressing 'a' for yes or 'd' for no, adding to the challenge of differentiating twin primes in an engaging manner. This game promotes critical thinking and a deeper understanding of prime numbers.", "Two_Player_Tetris.js": "\"Two_Player_Tetris\" is a multiplayer twist on the classic Tetris game where two players compete to stack blocks and clear lines. Players use separate controls to manage their respective sides of the screen, aiming to prevent their block stack from reaching the top. The game ends when one player fails, giving the other player a point.", "UFO_Attack.js": "\"UFO Attack\" is a strategy game where you play as a cow trying to eat hay while avoiding abduction by aliens. Navigate through various levels, pushing boxes and dodging obstacles to reach your goal. Use clever maneuvers to outsmart the UFOs and succeed in your mission.", "UltimateTicTacToe.js": "UltimateTicTacToe is a complex version of the traditional Tic Tac Toe game designed for two players. In this puzzle game, players must win three small Tic Tac Toe boards in a row to claim victory on the large board. The available small board for each move is determined by the opponent's previous move, adding a strategic twist to this classic game.", "UpSideDown.js": "\"UpSideDown\" is an endless platformer game where the player must survive as long as possible by navigating moving platforms. The unique twist is that the player can only move by switching the direction of gravity. Players switch gravity to either fall upwards or downwards to avoid falling into the void or hitting obstacles.", "Up_Down_Top-down.js": "\"Up, Down, Top-down\" is a platformer and maze game where the player navigates through 20 levels, facing obstacles like long jumps, gravity-changing blocks, and intricate mazes. It features a comprehensive menu and guide system and uses various in-game blocks and flags to create an engaging progression and challenge. For more details, see the documentation on the [Github repo](https://github.com/Somebud0180/Up-Down-Top-down/).", "ValentinesGame.js": "ValentinesGame is a Sokoban-style puzzle game designed for two players, themed around love. Players control two halves of a heart, moving them using separate controls, with the goal of positioning them next to each other to form a full heart. It serves as a base for creating and sharing levels, ideal for friends or couples.", "Virtual_Machine.js": "Virtual_Machine is a strategy game where players navigate through various levels with no time or score pressure. The goal is to explore, push blocks, and avoid obstacles in a relaxed, fun environment. Developed using JavaScript, this game is a way to engage with the new Sprig Console and experience a different approach to game development.", "Voltage_Quest.js": "\"Voltage_Quest\" is a puzzle game where the objective is to power on a factory by strategically pushing batteries to complete circuits. Players navigate through various levels by moving blocks to specific goals, ensuring the electrical flow is restored. The game features a combination of obstacles and pathways that challenge the problem-solving skills of the player.", "Watermellen_man_and_bluebarry_man.js": "\"Watermellen_man_and_bluebarry_man\" is a two-player puzzle game where each player must guide their character to their respective portals using specific movement keys. Both Watermellon Man and Bluebarry Man have to reach their portals simultaneously to advance to the next level. The game involves navigating through various mazes and obstacles.", "Waze.js": "\"Waze\" is an advanced shooter game where players must navigate through multiple levels, facing progressively more challenging zombies. The objective is to survive as long as possible while shooting enemies and achieving high scores. As players advance to the second level, they must report their scores and see how long they can withstand the onslaught.", "Womens_roles_during_wartime.js": "\"Women's roles during wartime\" is a thematic puzzle game focusing on women's contributions and changing roles during World War I and II. As the player navigates a crown symbolizing women's transformation, they collect various rights and opportunities to advance the storyline. The game highlights how women gained and then often lost these roles and rights after each war.", "Worldcraft.js": "\"Worldcraft is a peaceful 2D exploration and building game where you control a blob character. Traverse through diverse maps using portals, gather resources like stone and wood, and construct various structures. With no specific objectives, players can enjoy the game at their own pace, focusing on exploration and creativity.\"", "Zooter.js": "Zooter is a dodge game where players control a character to avoid oncoming enemies and eliminate them with projectiles. The game rewards precision and timing as players must skillfully navigate and survive waves of enemies. Created as a fun project, it explores basic game mechanics in a nostalgic arcade style.", "aMAZE.js": "aMAZE is a puzzle game where players help a princess navigate through three challenging mazes to reach her coronation. Each level involves moving through obstacles and walls towards the goal. The game features sokoban-style gameplay with a fairytale theme.", "air_hockey.js": "Air_hockey is a classic two-player game inspired by the real-world arcade game. Players control paddles to prevent the puck from hitting their sides while trying to score against their opponent. The objective is fast-paced, competitive fun, with simple mechanics centered on reflexes and strategy.", "alien.js": "\"Alien\" is an endless game where players control a character to shoot lasers at aliens while avoiding asteroids. The goal is to earn points by hitting aliens with the laser; missing an alien results in a loss of points. The game ends when the laser hits an asteroid or time runs out.", "alien_invaders.js": "\"Alien Invaders\" is a simple clone of the classic \"Space Invaders\" game. Players control a spaceship, shooting lasers to destroy waves of approaching aliens. Victory is achieved by eliminating all alien forces, while the game ends if the aliens reach the player's position.", "ambitious_ape_maze_game.js": "\"The Ambitious Ape Maze Game\" is a maze navigation puzzle where players help an ape traverse through forested mazes to find his poop crown. Players must find keys to unlock barriers and push boxes to clear pathways. The goal is to reach the crown to advance through increasingly challenging levels.", "among_us_maze.js": "\"Among Us Maze\" is a web-only, advanced maze navigation game created by Riya and Christy as part of the Assemble Arcade project. In this game, players navigate through a maze filled with obstacles and points of interest, with the option to control a virtual mouse using keyboard inputs. The overall theme revolves around navigating the maze without cheating to reach the end point and claim victory.", "amongus.js": "\"Among Us Survival\" is a survival game where you control an Among Us character that must evade falling fire bombs. If the character gets hit by a bomb, the game restarts. Players choose from different difficulty levels and aim to achieve the highest score by surviving as long as possible.", "attack_on_slimes.js": "\"Attack on Slimes\" is an endless defense game where you protect a tower by casting random spells to fend off invading slimes. As time progresses, the number of slimes and their difficulty increases, challenging your ability to hold the tower. Your score increases over time and by defeating slimes.", "balloon.js": "\"Balloon\" is a simple maze navigation game where the player guides a balloon through various levels filled with obstacles. The goal is to reach the end of each maze without hitting impediments such as spikes. It was created as a learning project on the Sprig platform and showcases a recurring theme of balloons by the developer.", "banana_runner.js": "Banana Runner is a strategic puzzle game where the player navigates different levels to reach a portal without being caught by a moving knife. The player must avoid obstacles like trees and collect as many keys as possible along the way. The game requires careful planning and timing to successfully navigate through the challenges and progress to the next level.", "bannai-snake.js": "Bannai Snake is a thematic-puzzle game where the player navigates through a series of puzzles that follow specific rules for valid paths. The goal is to reach the endpoint while ensuring that paths are only one tile thick and avoid touching diagonally. Each level introduces new challenges and mechanics to test the player's strategic thinking and puzzle-solving skills.", "basic_tetris.js": "\"Basic Tetris\" by Ivan-Jehad is a classic Tetris game with a slight twist: the tetrominos are fragmented, making it more challenging to determine if a piece will fit into a given space. This added complexity adds to the visual strain, thus requiring more focus and strategy from players. The game is built using the Sprig editor and offers a familiar, yet more difficult Tetris experience.", "basketballgame.js": "Basketball Game is a puzzle-solving adventure where players navigate through various levels by moving blocks to goal points while avoiding obstacles such as spikes and enemies. The game features a mix of elements like walls, resurrection stones, and ghost models, adding complexity and challenge to the experience. Players progress through stages, unlocking unknown levels and respawning upon defeat.", "bastion.js": "\"Bastion\" is a 2-player cooperative game inspired by Fireboy and Watergirl where players control two characters, Fireboy and Watergirl, using different keys to navigate through levels filled with obstacles like lava, water, spikes, and buttons. Each character has unique vulnerabilities and players need to work together to reach the end of each level. The game emphasizes teamwork and strategy to overcome challenges and successfully complete all levels.", "battle_bots.js": "\"Battle Bots\" is a multiplayer game where two players compete to push each other into designated death zones while trying to avoid them. The game continues infinitely as players aim to achieve the highest score in this intense duel.", "bbbbbb.js": "\"bbbbb\" is a logic-based platformer with a unique twist inspired by the game \"vvvvvv\" by Terry Cavanagh. Players must navigate through levels by switching gravity to avoid spikes and reach goals. The game includes elements like keys, doors, and spikes to increase the challenge.", "black_jack.js": "\"Black_Jack is a classic casino card game where players aim to beat the dealer by getting a hand value closest to 21 without exceeding it. Players start with a balance of 500, adjust their bet, and make strategic decisions to hit, stand, or double down during each round. The dealer plays according to standard rules, and the outcome is determined by comparing hand values.\"", "blackjack.js": "The game is a digital version of Blackjack that challenges players to get their card total as close to 21 as possible without exceeding it, while following the traditional rules of Blackjack. Players can make bets, draw cards, and use strategic options like doubling down, with the addition of the \"5-Card Charlie\" rule, which grants an automatic win for drawing five cards without busting. The theme revolves around a classic casino card game feel, engaging players in an endless cycle of rounds and bets.", "blokl_the_hole.js": "\"Blokl the Hole\" is a puzzle game where players must navigate through levels to find the correct hole or goal and fill it. Players move a character on the map, avoiding walls and solving spatial problems to reach their objective. The game progresses through multiple levels of increasing complexity.", "bloxorz.js": "\"Bloxorz\" is a logic-based puzzle game where you navigate a rectangular block by rolling it across a grid to fit it into a one-block-wide goal. The challenge lies in maneuvering the block, which is two blocks long in one orientation but one block high, through various obstacles to align it perfectly with the goal. The game emulates a nostalgic experience reminiscent of old-school games.", "bob_and_joe.js": "\"Bob and Joe\" is a Sokoban-style game where the player helps Bob navigate through mazes to reach his friend Joe. The game involves moving blocks to clear paths and progress through increasingly challenging levels. Players can uncover a secret level by pressing 'L' on the right stage.", "bobs_bad_apple.js": "\"Bob's Bad Apple\" is a logic-based maze game where the player guides Bob to eat all the apples in each level to progress. The game includes pushable blocks that can be used to navigate through the maze. Each level presents new challenges as players strategize their moves to clear all apples and advance to the next stage.", "bolt_battle.js": "Bolt Battle is a remix of the game Candy Rush, where players must push lightning bolts onto corresponding colored batteries to clear levels. The game features multiple levels and introduces a Sokoban-style puzzle mechanic with color-matching elements. Players navigate through walls to align the bolts correctly on their respective batteries.", "bomb_dodge.js": "\"Bomb Dodge,\" created by AstralTurtle, is a logic-based survival game where players aim to stay alive as long as possible amidst exploding bombs. Players must maneuver around the playfield, avoiding the bombs that explode in straight lines across the x and y axes. The game's difficulty increases over time, adding more bombs and requiring quick thinking and strategy.", "bone_hunt.js": "Bone Hunt is a puzzle game where you play as a dog aiming to collect all of his bones to advance to the next level. Navigate through various levels by maneuvering around obstacles and fences to gather bones scattered around. Completing each level brings new challenges and configurations to solve.", "box_maze.js": "Box_Maze is a Sokoban-style puzzle game where the player pushes boxes through a maze to reach multicolored goals. The objective is to navigate through increasingly complex levels before the timer runs out. The game emphasizes strategic thinking and problem-solving as players plan their moves.", "boxy.js": "\"Boxy\" is a fun, classic-themed puzzle game where players push packages to Mr. Poptato (the green thing) while avoiding yellow enemies aiming to snatch the parcels. The objective is to complete levels as quickly as possible. The game features multiple challenging levels, and players can restart their current level or reset to the first level if necessary.", "brainboom.js": "BrainBoom is an advanced puzzle game where players write Brainf*** programs to complete specific tasks. Each level presents a unique challenge requiring logical and creative solutions. It features a variety of puzzles with escalating difficulty, designed to test and improve programming skills.", "breakfast_maze!.js": "\"Breakfast Maze!\" is a Sokoban-style puzzle game where a lonely splotch of jelly/jam navigates a maze of toast to reach a splotch of peanut butter. Players find keys to unlock secret areas and use portals to progress through increasingly complex levels. The goal is to reunite the jelly/jam with the peanut butter while overcoming maze obstacles.", "brick_breaker.js": "Brick Breaker is a strategy game where players control a paddle to direct a ball to break all the bricks in a level. The objective is to ensure the ball doesn't fall below the paddle while clearing each level to win the game.", "bullet_dodge.js": "\"Bullet Dodge\" is a fast-paced, action-packed game where you must navigate a heart through a field of incoming bullets from all directions to avoid losing health. Players can activate powerups to heal or slow down bullet spawn rates, adding a strategic element. The aim is to survive and dodge as many bullets as possible for the longest time.", "bullet_heaven.js": "Bullet Heaven is a shooter game where the player must defeat a boss by avoiding its bullets and shooting back. The primary objective is to deplete the boss's health while dodging incoming attacks to stay alive. The game's theme involves strategic movement and timing to dodge and counter-attack effectively.", "burger_build.js": "\"Burger Build is a dodge game where players catch falling ingredients to stack and create burgers. The game progresses through multiple levels, each requiring a specific sequence of ingredients to successfully complete a burger. If the player fails to assemble the correct burger, they must restart the level.\"", "calculator.js": "This game is a calculator simulation designed for the Sprig platform. It allows users to perform basic arithmetic operations and view results on a digital interface. The game operates by moving a cursor to select numbers and operations, making it an interactive tool for calculations.", "calculator_puzzle.js": "\"Calculator Puzzle\" is a thematic math puzzle game where players use the WASD keys to apply different mathematical operations to reach a target number. Each level presents a starting number and a goal, with keys bound to specific mathematical operations displayed on the screen. The game features 10 progressively challenging levels.", "candy_rush.js": "Candy Rush is a Sokoban-style puzzle game where the player pushes candies into the mouths shown on the grid. The player must strategically navigate through walls and various obstacles to align the candies with the mouths to advance through levels. The game progresses in difficulty, requiring careful planning and problem-solving.", "candyshopper.js": "\"Candyshopper is a puzzle game where the player pushes various types of candy into a shopping basket while avoiding obstacles. Each level presents a new challenge with different arrangements of candy and walls. The goal is to successfully place all candy in the baskets to progress through the levels.\"", "cat_in_rain.js": "\"Cat in Rain\" is a dodge game where the player controls a cat trying to avoid raindrops by moving left and right. The cat can use umbrellas to shield itself temporarily, and the objective is to reach the portal. The game was inspired by \"Dodge the Fireball\" by Sam Liu.", "catch_orpheus.js": "\"Catch Orpheus is a light-hearted game where players use WASD keys to chase and catch Orpheus, who erratically moves in different directions. The aim is to match the player's coordinates with Orpheus's to win. It was created as a demo for Sego Lily Hacks.\"", "catching_game.js": "\"Catching Game\" by Swastik Bajpai is a simple arcade game where the player must dodge falling fruits to score points. Players use the \"a\" and \"d\" keys to move left and right, avoiding the fruits as they descend. The game's blue background and progressively challenging levels add to the experience.", "cave_explorer.js": "Cave Explorer is a strategy game about mapping and coloring the interior of various caves. Navigate through the cave layouts by guiding your player character, marking paths as you go, and resetting when needed. The objective is to cover the entire walkable area of the cave without leaving any spots unmarked.", "celeste.js": "\"Celeste: Sprig Edition\" is a highly challenging platformer inspired by the 2018 game \"Celeste\" by Extremely OK Games, tailored specifically for the Sprig platform. The game emphasizes difficult gameplay with mechanics such as dashing, jumping, and collecting strawberries, incorporating elements like spikes and springs. Its initial release features tough levels and aims to expand with more content and improved visuals in the future.\"", "chain_remove.js": "\"Chain_Remove\" is an endless puzzle game where the player eliminates squares of the same color, causing connected squares of the same color to also be removed. If a bomb is included in the chain, it clears a 3x3 area around it. The game has no points or goals, offering continuous play.", "charge.js": "\"Charge is a turn-based strategy battle minigame where you use various items to outsmart your enemy, Bob. The game involves charging up resources to deploy different attacks and defenses, with the aim of winning rounds against your opponent. It combines tactical decision-making with item management to create an engaging strategic experience.\"", "chase_bob.js": "\"Chase_Bob is a maze exploration game where the player navigates through levels to catch Bob while avoiding Orpheus and the Hitman. The player must strategically move and react quickly as adversaries move unpredictably across the map. Success is measured by capturing Bob, while contact with the enemies leads to a loss.\"", "chess.js": "This is a digital version of the classic board game Chess featuring multiplayer support. As a turn-based strategy game, players move pieces according to traditional chess rules to checkmate the opponent's king. The interface highlights the current player's turn and enables moving pieces via cursor-based selection and placement.", "chess_puzzle_knight.js": "\"Chess Puzzle\" is a strategic puzzle game based on the movement of the chess knight. Players must navigate the knight across a board filled with obstacles to reach the goal. Each level challenges the player to move the knight in the classic 'L' shape while avoiding walls and barriers.", "chuckman_go.js": "\"Chuckman Go\" is a strategy game where players navigate through paths filled with enemies to reach a goal. Players must avoid various types of enemies while navigating the terrain to reach the finish (marked in yellow). The game consists of multiple levels with increasing difficulty.", "coding_demo_1_linked_sprites.js": "Coding Demo 1 - Linked Sprites is a beginner-friendly demo game that showcases linked sprite movement mechanics. Players control two parts of a character that move together, navigating around obstacles. This game demonstrates basic movement and collision logic.", "coding_demo_2_multiple_maps.js": "\"Coding Demo 2 - Dual Maps\" showcases how to use the addMap function to introduce multiple map layers in a simple game environment. The game features basic movement mechanics, where the player can push boxes around a small grid. It serves as an easily hackable example for beginners to understand map layering and sprite manipulation.", "coding_demo_3_custom_directions.js": "This is a beginner-friendly programming demo called \"Coding Demo 3: Custom Directional Solids\" by Leonard (Omay). It features a player navigating a grid-based map with custom directional solid objects, which restrict movement in specific directions. The demo aims to illustrate how to implement and handle these movement constraints in a game.", "coding_demo_4_screen_scroll.js": "This game is a basic screen-scrolling demo designed for beginners. It involves navigating a player character through a maze, with the map dynamically resizing and repositioning based on the player's movement. The primary focus is on demonstrating how to capture and modify the current state of the map for a scrolling effect.", "coding_demo_5_gravity.js": "\"Coding Demo 5: Gravity\" is a simulation game that demonstrates the effect of gravity on a player character. Players can jump and move left or right within a structured map while experiencing gravity's pull. It serves as an educational tool for beginners to understand and experiment with gravity in game mechanics.", "collectcandy.js": "\"Collectcandy\" is a game where players aim to collect candy while avoiding ghosts on a continually changing map. Every time the player collects 6 candies, both the map and challenges change, adding new obstacles and difficulty. The game is about quick reflexes and strategic movement to maximize candy collection without being caught.", "color_domination.js": "\"Color Domination\" is a multiplayer strategy game where players take turns dominating adjacent spaces on a grid. Each player has a distinct color and aims to prevent the other player from making any more moves. The game ends when a player successfully blocks all possible moves of the opponent or the grid is fully occupied.", "color_patterns.js": "\"Color Patterns\" is a logic-based puzzle game where players must replicate given color patterns on a grid. Using red and blue tiles, players move around the map to color the tiles correctly according to the sequence provided at each level. The game advances as players successfully match the patterns.", "compudino.js": "\"Compudino\" is a Tamagotchi-style game where players care for a dinosaur pet by feeding it, playing with it, and providing medical attention. The game involves progressing through various levels by performing actions like feeding (press 's'), playing (press 'a'), and medical care (press 'i'). The theme revolves around nurturing your prehistoric pet and watching it evolve.", "confusing_conditions.js": "\"Confusing Conditions\" is a Sokoban-style game with a twist, designed to challenge and subvert player expectations. Players navigate levels by moving boxes to designated goals, but the rules change unpredictably with each stage. This game offers a unique and perplexing experience by continuously altering what players might presume to be the norm.", "connectTheDots.js": "\"Connect the Dots\" is a strategy game where players must connect corresponding colored dots on a grid. The game is a recreation of Flow Free, featuring original level maps. Each level challenges players to draw paths between dots without overlapping the lines.", "connect_four.js": "Connect Four is a classic two-player connection game where players take turns dropping colored tokens into a vertical grid. The goal is to be the first to align four of your tokens in a row, column, or diagonal before your opponent. The game features yellow and red tokens, with visual indicators for each player's turn.", "conwaysgameoflife.js": "Conway-GOL is a simulation game based on Conway's Game of Life, a cellular automaton devised by mathematician John Horton Conway in 1970. This sandbox game lets players simulate the evolution of cellular patterns over time with various control options, including pausing, single-step iteration, speed adjustment, and a debug mode. It's a zero-player game where the user sets initial conditions and observes how the pattern self-evolves on the grid.", "cookie_clicker.js": "\"Cookie Clicker\" is an endless incremental game where players earn money by clicking on a cookie and purchasing upgrades to increase earnings. Players can buy \"Cookies Per Second\" and \"Cookies Per Click\" upgrades to enhance their income over time. The game features a straightforward interface and an endless gameplay loop.", "cool_platformer.js": "\"Cool Platformer\" is a strategy-based platformer game where players must navigate through levels by collecting coins and reaching the designated goal. Unique mechanics such as movable boxes and double jumps add layers of challenge as players avoid hazards and solve puzzles. The objective is to collect all coins in each level and safely reach the goal to progress.", "crappy_bird.js": "\"Crappy Bird\" is an endless classic game where players control a bird attempting to navigate through a series of obstacles. The bird alternates between flapping up and down, requiring precise timing to avoid crashing into walls. The game's difficulty increases as players progress through different levels with varying wall patterns.", "creepy_crush.js": "\"Creepy Crush is a horror-themed match-three puzzle game where players swap neighboring tiles to create runs of three or more matching tiles. Players have two minutes to achieve the highest score, with special bonuses awarded for four-tile and five-tile matches. The game, inspired by Candy Crush, introduces spooky elements like skulls, ghosts, and other eerie icons.\"", "cricket_frenzy.js": "\"Cricket Frenzy\" is a Sokoban-style puzzle game where players maneuver a cricket ball to a target using a bat, navigating around obstacles like walls and strategically pushing boxes. The game poses a series of levels that challenge spatial reasoning and problem-solving skills. The ultimate goal is to cover all target points with boxes to advance through increasingly complex stages.", "crimbletips.js": "\"CrimbLetips\" is an adventure game where players explore the mysterious world of CrimbleTips to escape. The game involves investigating various locations, collecting items, and solving puzzles to proceed. The player faces different challenges and obstacles that need to be overcome using items found during the journey.", "cube_escape.js": "Cube Escape is a logic-based game where the player controls a cube attempting to escape from a cube prison. Navigate through various levels using warp portals and avoid or eliminate enemies to survive while collecting key items to unlock paths. Strategic movement and careful planning are necessary to advance and ultimately escape.", "cubefield.js": "\"CubeField\" is an endless dodging game inspired by a popular TI calculator game. Players navigate through a field of moving cubes that become faster and more numerous as their score increases. The game is over if the player collides with a cube, with levels distinguished by different cube colors.", "delightful_mazes.js": "Delightful Mazes is a logic game where players must navigate through invisible mazes, pushing secret trapdoors to score points. Each level requires finding hidden paths and exits without visual clues of walls or goals. The objective is to open all trapdoors to win, with the score determined by the number of trapdoors successfully opened.", "desi-pong.js": "Desi-Pong is a classic arcade-style game where two players compete to score points by controlling paddles to hit a ball back and forth. The game ends when either player reaches 10 points. It includes sound effects for hits and points, enhancing the retro gaming experience.", "dicee_dare.js": "Dicee Dare is a game where players use a virtual dice to randomly determine dares from a pre-prepared list. The game involves rolling the dice, which displays a number corresponding to a specific dare, and then performing that activity with friends. It’s designed for fun social interactions and can be enjoyed in various settings.", "dihydrogen_monoxide_free_fall.js": "\"Dihydrogen Monoxide Free Fall\" is an endless survival game where you control a raindrop falling from the sky. You must avoid damaging fireballs, which fall faster than you, and collect healing droplets, which fall slower. The objective is to survive for as long as possible.", "ding_dong-delivery.js": "\"Ding Dong Delivery\" is a puzzle game where you play as an Amazon delivery person tasked with delivering packages to their designated addresses. Navigate through various levels by pushing boxes to their goals while avoiding obstacles like potholes. Each level is completed when all packages are delivered to the correct spots.", "dino-game.js": "\"Save Orpheus - Chrome Dino Game Remake\" is a modern take on the classic Chrome dinosaur game where players must help a dinosaur named Orpheus jump over cacti and avoid raptors. The objective is to keep running for as long as possible without hitting any obstacles. The game's theme embraces a prehistoric survival challenge with simple yet engaging mechanics.", "dino.js": "\"Dino\" is an endless runner game where the player must jump over birds to survive. The game continually scrolls, challenging the player to time their jumps perfectly to avoid obstacles. The theme is simple and reminiscent of classic pixelated arcade games.", "drab_bullets.js": "\"Drab Bullets\" is an endless dodging game where players must avoid falling bullets and curses. Players control a character that can move left or right to evade obstacles. The game ends when the player loses all their lives.", "dual_state_machine.js": "Dual State Machine is a strategy puzzle game where the objective is to turn all tiles yellow by stepping on them. Players navigate through levels, changing the color of tiles under their feet from blue to yellow. The game is completed when all tiles turn green, signifying that the puzzle has been solved.", "dvd_logo_simulator.js": "\"DVD Logo Simulator\" is an endless simulation where you watch the classic DVD logo bounce around the screen and change colors upon hitting the edges. The goal is to see the logo hit the corners of the screen, prompting a special corner-hit message. Users can restart the simulation to generate a new starting position and velocity for the logo.", "earth-takeover-2.js": "\"Earth Takeover (Maze)\" is a strategy puzzle game where you navigate through mazes to collect Earth items while avoiding various traps and obstacles. The game becomes increasingly challenging as you progress through levels and stages. Conserve steps wisely to succeed in saving your alien friends and taking over Earth.", "eat_the_cake.js": "\"Eat the Cake\" is a mini game centered around choices where the player navigates a character to either a piece of cake or broccoli. The goal is to explore the outcomes based on which item the character reaches. This beginner-friendly game emphasizes decision-making in a simple, hackable format.", "echolocation.js": "\"Echolocation is a logic game where players navigate a maze using sound cues. By listening for specific audio signals that indicate walls and the goal, players must move through the maze to find the objective. The timing between hearing a sound and pressing a button indicates the distance to obstacles or the goal.\"", "escape_arcade_prison.js": "\"Escape Arcade Prison!\" is a timed puzzle game set in a whimsical prison where you must escape within 5 minutes. You were jailed by the hack club staff for committing ticket fraud and need to navigate through guards, lasers, and locked doors to find keys and solve minigames to secure your freedom. The game's humorous lore and challenging gameplay create a fun, engaging experience.", "escape_room.js": "\"Escape Room\" is a Sokoban-style puzzle game where the player navigates through various levels filled with walls and obstacles. The objective is to reach the goal, advancing to more challenging stages. The game's theme revolves around problem-solving and strategic maneuvering to escape each room.", "ever_hot.js": "\"Ever_Hot\" is an endless survival game combining elements of the rhythm indie game Everhood and the shooter Superhot. Players must dodge attacks that appear based on their movements; the more they move, the harder it gets. The objective is to survive as long as possible without getting hit.", "explorer.js": "\"Explorer\" is a game about navigating an abandoned laboratory to kill enemies while utilizing the unique properties of a magical sword. Players switch between being immune to monsters and pushing obstacles when unarmed, and defeating enemies and traversing walls when wielding the sword. The goal is to beat all enemies in the final room to win the game.", "fallen_sand.js": "Fallen Sand is a simple physics sandbox game where players can interact with elements like sand, water, and concrete. Users can create, manipulate, and erase these elements to observe their behaviors and interactions. The game provides an experimental environment for understanding basic physics principles in a playful way.", "far-from-home.js": "\"Far from Home\" is a puzzle game where the goal is to navigate a child (player) through various obstacles and bring them home. The game consists of multiple levels featuring walls, lasers, and other challenges that players must overcome to guide the child to the target. It incorporates strategic movement and problem-solving to successfully complete each level.", "fight_against_covid.js": "\"Fight against COVID\" is a fast-paced game where players must shoot incoming COVID viruses to prevent infection. The gameplay involves managing limited bullets and occasionally acquiring a berserk power-up for enhanced shooting capabilities. The objective is to survive as long as possible while accumulating a high score.", "fight_big_parma.js": "\"Fight Big Parma\" is a tower defense game themed around combating giant wheels of parmesan cheese. Players strategically place towers to protect their territory from the advancing cheese enemies. The game revolves around resource management and tactical placement to fend off the oncoming food invasion.", "fill_the_map.js": "\"Fill the Map\" is a strategy game where players must cover all the tiles on the map without overlapping or retracing their steps to move to the next level. Players navigate through various layouts with obstacles, aiming to fill every available space. The challenge includes dealing with some edge-based glitches in the game map.", "find_a_friend.js": "\"Find a Friend\" is a game where players must navigate a course to find and connect with friends while avoiding enemies. The player can move up and down to evade bad influences and seek out positive ones. This game is designed to highlight the importance of good choices in a simple and engaging way.", "find_the_clone.js": "\"Find the Clone\" is a puzzle game where players must identify and push the box that stands out from the rest to reach the goal. The game challenges your attention to detail and problem-solving skills. Created by TheGoldenBlock, it offers a series of increasingly difficult levels to test your puzzle-solving abilities.", "find_the_watermelon.js": "\"Find the Watermelon\" is a puzzle game where the player navigates a character through mazes to reach a watermelon while avoiding walls and bombs. The player solves progressively difficult levels, each with its own unique challenges and obstacles. This game emphasizes strategic movement and problem-solving skills.", "fire_boom.js": "\"Fire Boom\" is a dodge-and-survive game where players must move side-to-side to avoid falling fire obstacles. Players can shoot water to extinguish the fire, aiming to survive as long as possible. The game ends when a player is hit by the fire.", "flappy_bird_but_no_gravity_and_worse.js": "\"Flappy Bird But No Gravity and Worse\" is an endless game where you navigate a character vertically to avoid incoming walls. The player must dodge obstacles that move horizontally across the screen, aiming to survive as long as possible and achieve a high score. This game removes the traditional gravity mechanics of \"Flappy Bird,\" presenting a unique twist on the genre.", "flappysprig.js": "\"Flappysprig\" is a game inspired by the classic Flappy Bird, featuring a character from SprigressBar, created by MathR. Players control the Sprig character as it navigates through a series of pipes, trying to avoid collisions and earn points. It is tagged as a classic-style game and was developed by Spectral in 2023.", "floppyMatch.js": "\"floppyMatch\" is a logic-based game where players control a pointer to match floppy disks. A floppy disk appears at the top, and players must correctly select matching top and bottom parts to score points. The goal is to accumulate ten points to win while avoiding three strikes that reset progress.", "flying_game.js": "\"Flying Game\" is a puzzle game where players navigate a character to move boxes onto designated goal spots. It follows a Sokoban-style gameplay mechanic with levels increasing in complexity. The game's objective is to cover all goal spots with boxes to progress to the next level.", "fogged.js": "\"Fogged\" is a maze exploration game where the map changes as the player moves, adding an element of unpredictability and mystery. Players must navigate through walls and find their way to the goal, with the shifting map creating new challenges at every step. The game encourages dynamic decision-making and exploration.", "font-explorer.js": "\"Font Explorer\" is a tool designed to display and navigate through the font set available on the Sprig platform. It allows users to explore different glyphs by moving a cursor across the screen and flipping through pages to view all characters. This tool is especially useful for developers and designers working with Sprig fonts.", "for_Squiggly_myLost_worm.js": "\"For Squiggly: My Lost Worm\" is a sokoban-style puzzle game where the player navigates a blue worm to a golden crown. The unusual twist is that the movement controls are inverted, adding an extra layer of challenge. This game serves as a memorial for the creator's third-grade pet, Squiggly.", "fractal_generator.js": "Fractal Generator is a sandbox simulation app that allows users to explore and generate Mandelbrot fractals. Users can pan around and zoom in or out to observe different parts of the fractal, providing educational and visual novelty.", "friendship.js": "\"Friendship!!! <3\" is a beginner-friendly strategy game where two characters, Vera Vertical and Horace Horizontal, must work together to reach their goals. Vera can only move up and down, while Horace can only move left and right, and they can push each other to help navigate the levels. The game emphasizes cooperation and problem-solving to achieve their respective targets.", "froggo_s_dungeon_adventures.js": "\"Froggo's Dungeon Adventures\" is a dungeon-themed game where players navigate through multiple levels, encountering enemies and solving puzzles to reach the end. The goal is to survive the dungeon by managing health, combating foes, and utilizing teleportation mechanics. The game features a cute protagonist and various obstacles with the main challenge being to simply get to the end.", "fruit_catcher2.js": "Fruit Catcher Deluxe is a fast-paced game where players control a basket to catch falling fruits, such as apples, bananas, and strawberries, within a limited time. As fruits drop from the top of the screen, players must move quickly to gather them and increase their score. The game ends when the timer reaches zero, and the final score is displayed.", "fruit_pusher.js": "\"Fruit Pusher\" is a puzzle game where a banana-looking character pushes oversized fruit onto designated goal areas. The player must strategically move various fruits to specific spots to advance through levels. Each puzzle presents unique challenges, requiring thoughtful planning and maneuvering.", "fungi-frog-maze.js": "\"Fungi-Frog-Maze\" is a logic puzzle game where players help a fungi-frog navigate through various levels to reach the destination. The frog can push fungi to move rocks, travel through wooden walls, but cannot cross water. Each level presents unique challenges, with some levels free of obstacles like rocks.", "galactic.js": "\"Galactic\" is a strategy game where players build a new city on another planet and manage the resources and well-being of their citizens. Players collect wood and stone to construct, upgrade, and manage various buildings to ensure their population thrives. The object of the game is to maintain a balance between population capacity and happiness, preventing overpopulation and potential disaster.", "galactic_coconuts.js": "\"Galactic Coconuts\" is a dodge game where players maneuver a character to avoid falling coconuts and shoot at them to gain points. Inspired by asteroids, the game includes normal and golden coconuts, with golden ones providing extra score bonuses. Available actions include moving left and right and shooting to maximize the score.", "galloping.js": "\"Galloping!\" is a dodge game where players control a speeding horse to avoid crashing into trees. The objective is to survive by dodging obstacles until the timer runs out for the stage. The game's challenge increases with each level as new hazards are introduced.", "generic_dungeon_crawler.js": "\"generic_dungeon_crawler\" is a classic dungeon exploration game where players navigate procedurally generated maps, engaging in battles with a variety of monsters, collecting loot, and upgrading their equipment. Players manage an inventory, make strategic decisions in shops, and gain experience to level up. The game emphasizes exploration, combat, and item management in a fantasy-themed dungeon setting.", "get_the_birdie.js": "\"Get_the_birdie!\" is a Sokoban-style puzzle game where the player navigates through levels filled with walls to catch a bird. The player must strategically move to reach the bird in each level, advancing by clearing obstacles and planning their path. The game features progressively challenging levels and playful in-game music.", "get_the_green.js": "\"Get the GREEN!\" is an endless game where players must navigate a grid to reach a green target as quickly as possible while avoiding red obstacles before the timer runs out. Each level presents an increasing number of red obstacles to avoid. The game requires quick reflexes and strategic movements to progress.", "getting_started.js": "\"Getting Started\" is a beginner-friendly tutorial game that involves guiding a player character to push boxes onto goal tiles while navigating around obstacles like walls. The game features multiple levels of increasing complexity to help new players learn the basics of game mechanics. It's designed to be educational and easy to follow, making it perfect for newcomers.", "girl_scouts_x_hack_club.js": "\"Girl Scouts x Hack Club\" is a themed game where players deliver Girl Scout cookies to Orpheus. Navigate through levels by moving the player character to push cookies towards Orpheus. It's a collaborative event game focusing on problem-solving and fun.", "go_home.js": "\"Go_Home\" is an advanced puzzle game where players strategically push boxes onto targets to unlock their escape. There's a surprising twist as the game unfolds, adding complexity and intrigue to what initially seems like a simple task. The game includes immersive story elements and challenges that demand both strategy and creativity.", "goaled.js": "\"Goaled\" is a fast-paced game where you control a purple player trying to push a gray ball into a randomly teleporting yellow goal. The objective is to score as many goals as possible within 30 seconds, with the added challenge of moving the ball strategically and resetting positions when needed. It's a game of quick thinking and precise movements.", "golf.js": "Pixel Peril is a golf-themed game where the objective is to get the ball into the hole using as few strokes as possible. Players adjust the power and angle of their shots to navigate the ball towards the hole. The game features a simple pixel art style.", "gravity-is-a-thing.js": "\"Gravity is a Thing\" is a logic-based platformer game where players navigate through levels by jumping on boxes and avoiding lava to reach the trophy. Players can double jump and must restart the level upon touching lava, moving on to the next level when they successfully reach the trophy. Developing careful strategies and timing jumps are key to progressing in the game.", "gravity-platformer.js": "Gravity Platformer is a progressively challenging platformer game where players navigate through levels by jumping and collecting keys to unlock new areas. The game features a unique mechanic of inverting gravity, adding complexity to reaching the green goal at the end of each level. Developed by NotRewd, this game prompts players to think creatively to conquer various obstacles and succeed.", "gravity_box.js": "\"Gravity Box\" is a puzzle game where players manipulate gravity by rotating the world 90 degrees to guide a box towards its goal. The gameplay revolves around the box reacting to gravitational forces in different orientations to navigate through mazes and obstacles. The objective is to reach the designated goal by strategically altering the world's gravity.", "gravity_fun.js": "\"Gravity Fun\" is a classic arcade-style game where players must navigate a character through a series of pipes. The aim is to avoid hitting the pipes by pressing the 'W' key to make the character flap or fly and achieve the highest score possible. The game's challenge increases as pipes continuously move, requiring precise timing to succeed.", "gtbc.js": "Ghosbly: Turn Based Combat is a game where you battle against five different creatures to emerge victorious. Each encounter involves strategic use of attacks, healing, and dodging specific glowing attacks. As you progress, each opponent presents unique challenges with varying health, damage, and attack patterns.", "guidance.js": "\"Guidance\" is a strategy game where the objective is to guide the player character to a green goal as quickly as possible. Instead of directly controlling the player, you place arrow blocks on the grid to change the player's direction upon contact. The challenge lies in wisely positioning the arrows to navigate around barriers and reach the goal efficiently.", "hackcraft.js": "Hack Craft is a voxel-based simulation game where players can build and mine structures. It offers various modes that allow for placing blocks, mining blocks, and managing inventory. The game was created using the Sprig editor and incorporates elements of classic simulation gameplay.", "hallowed_knight.js": "Hallowed Knight is a metroidvania-inspired game featuring a non-linear world map, unlockable movement abilities, and various collectibles to obtain. Explore areas such as the \"crossroads\" and \"greenpath,\" battle enemies, and navigate hazards. Collect grubs and complete the game to achieve a high completion percentage.", "hangman.js": "Hangman is a classic word-guessing game with a high-stakes twist where players must figure out a hidden word to avoid losing. Using a cursor to select letters, the player attempts to complete the word before making too many incorrect guesses. Each incorrect guess brings the player closer to \"hanging,\" adding a thrilling element of suspense.", "haunted-office.js": "\"Haunted Office\" by Aleyah is a puzzle game where you play as a ghost trying to escape an office. The ghost must find keys and use portals to navigate through various levels while avoiding pumpkins. Each level presents different challenges that require strategic movement and timing to succeed.", "hex_hubbub.js": "Hex Hubbub is a thematic puzzle game designed to practice converting hexadecimal numbers to binary. Players are presented with a hex number and must use specific keys to flip the bits corresponding to each segment of a digital display. The goal is to correctly convert all 16 digits; incorrect submissions require restarting.", "hidden_maze.js": "\"Hidden Maze\" is a logic-based game where players navigate through increasingly complex mazes without seeing the walls, guided only by their current location and the end goal. As players progress through the levels, the mazes become larger and more difficult. The objective is to reach the golden trophy, signaling the completion of each maze, with the ultimate goal of completing all five mazes.", "hidden_maze_escape.js": "Hidden Maze Escape is a logic-based game and the final installment in the hidden maze trilogy by Rylan Berry. The goal is to navigate through mazes where walls are visible this time, solve puzzles by positioning blocks, and uncover secrets to achieve different endings. The game offers a fresh take on the hidden maze concept by incorporating puzzles that must be completed to fully escape.", "hidden_maze_infinite.js": "\"Hidden Maze Infinite\" is an endless maze game where players navigate through procedurally generated labyrinths to reach the goal. The mazes come in three difficulty levels (Easy, Normal, Hard), and completing each maze increases the player's score. It's the second game in a planned trilogy that expands on its predecessor by offering unlimited levels.", "hot-digitty-dog.js": "\"Hot-Digitty-Dog is an endless running game where a hotdog must escape from invading pineapples while staying hydrated with mustard. Players navigate the hotdog up and down to collect mustard and avoid pineapples, with increasing difficulty over time. The goal is to survive as long as possible and achieve a high score.\"", "huff_ptegwu.js": "\"Huff Ptegwu is a two-player soccer-inspired game with a twist of teleportation. Players push the ball to score points, and the first to score five points wins. It features creative mechanics where players and the ball can teleport across the field, adding an extra layer of strategy.\"", "ice_cream_chef.js": "\"Ice Cream Chef\" is a time management game where players select the correct ingredients to assemble an ice cream sundae based on customer orders. Completing orders increases the player's score, but selecting the wrong topping or taking too long results in losing a life. The player starts with three lives, and the game restarts the order when a mistake is made.", "inconsequential_leveldungeon.js": "\"In Inconsequential Leveldungeon, players navigate through a randomly-generated dungeon, collecting keys to unlock the portal and escape while avoiding traps. The dungeon layout changes every game, providing fresh challenges each time. Watch out for traps and beware—the cake is not what it seems.\"", "infinite_cat.js": "\"Infinite Cat is a strategy game where players help a cat rule a garden by expanding to fill all available green blocks. The cat moves in the direction directed by the player and grows as it moves. The challenge is to navigate without colliding with the cat's own body to successfully complete each level.\"", "infinite_maze.js": "\"Infinite Maze is an endlessly generated maze game where players navigate through randomly created labyrinths using WASD or IJKL to move. The objective is to reach the goal and increase the maze size with each success. The game offers an ever-challenging environment that evolves dynamically.\"", "itsagame.js": "\"Chest Game\" is a simple puzzle game where the objective is to push a box to a designated goal. Players navigate through various levels, overcoming obstacles and strategically moving the box to succeed. The game challenges spatial reasoning and problem-solving skills.", "jeff_boxos.js": "\"Jeff Boxos\" is a puzzle game where you navigate the character Jeff Boxos through various levels filled with obstacles. The player must solve puzzles and overcome challenges to progress through the 27 increasingly difficult stages. The game is designed to last around 30 minutes for new players.", "jeffreys_house_escape.js": "Jeffrey's House Escape is a puzzle game where the objective is to collect a key and find the path to the door to proceed to the next level. Players must navigate through a grid, moving as far as possible in one direction until stopped by a wall or obstacle. Each level is randomly generated, adding a unique challenge each time.", "jumping_banana.js": "\"Jumping Banana\" is an endless dodge game where players control a banana that jumps to avoid blocks of dirt. The objective is to navigate through the obstacles for as long as possible by utilizing single, double, and triple jumps. The game ends when the banana hits a block, with an option to restart by pressing 'J'.", "keyTester.js": "KeyTester is a simple tool designed to check the functionality of your keyboard buttons. Each press of a key results in a visual indicator and an auditory beep, helping you verify that your keyboard inputs are working correctly. It's not a game in the traditional sense but rather a utility for testing hardware.", "killer_training.js": "\"Killer_Training\" is a timer-based puzzle game where players navigate mazes and shoot a puppet enemy. The challenge is to find the correct path and avoid touching the puppet, as doing so restarts the game. Players must complete various levels within a set time limit, with bonus practice modes available for more relaxed play.", "killpigs.js": "\"Kill Pigs\" is a logic-based game where you play as a storm god aiming to hunt pigs for dinner. As you progress through four levels, the number of pigs increases, and you need to precisely choose and eliminate the right pig using a ray. The goal is to successfully hit the target pig in each level.", "kilroy_saves_the_game.js": "\"Kilroy Saves the Game!\" is a narrative-driven game featuring a robot named Kilroy who must find a replacement bolt to fix a broken robot and help a team win their robotics competition. Players navigate through various maps and interact with objects to locate the correct components, all while engaging in a storyline centered around teamwork and problem-solving in the context of a robotics challenge. The game emphasizes STEM themes and the importance of quick thinking and cooperation.", "kindless.js": "\"Kindless\" is an advanced-level game designed by Ishan (@quackduck), featuring a challenging theme where the game itself can be unforgiving. Players must navigate through levels filled with obstacles using strategic movement to reach the target, all while dealing with potentially brutal consequences for mistakes. The final level is particularly difficult and may require significant skill to beat.", "kitchen_nightmares.js": "\"Kitchen Nightmares\" is a fast-paced, action game where you play as a chef dodging tomatoes thrown at you from multiple directions. Inspired by \"Space Invaders\" and \"Kitchen Nightmares,\" your goal is to survive as long as possible and achieve a high score. The game tracks your score based on the time you manage to avoid the projectiles, making it challenging and fun.", "knight-buster.js": "\"Knight Buster\" is a 2-player game where a playful Halloween ghost chases a friendly but easily frightened castle knight. Each player strategically pushes or avoids boxes while the ghost tries to catch the knight, and the knight attempts to escape until the ghost has interacted with the boxes too many times. Victory conditions depend on the players' abilities to outmaneuver each other within the game area.", "laser_tag.js": "\"Laser Tag\" is a hackable strategy game where players must navigate through levels to reach a green block while avoiding hazardous laser beams. Players need to coordinate movement carefully to steer clear of the dynamic laser patterns that can eliminate them. The game emphasizes both puzzle-solving and timing skills.", "learn_morse.js": "Learn Morse is an educational game designed to help users learn Morse code. Players match English letters to their corresponding Morse code representations in randomized levels, using movement and selection mechanics to confirm their choices. As the levels and letters are random, it challenges players to effectively learn and recognize Morse code patterns.", "lights_out.js": "\"Lights Out\" is a logic game where the objective is to turn off all lights on a 5x5 grid by flipping tiles. Pressing a tile will toggle its state along with the adjacent tiles, and you aim to achieve this with the fewest moves possible. The game progresses through 20 increasingly challenging levels.", "little_archeologist.js": "\"Little Archeologist\" is a puzzle game where you play as an archeologist navigating different levels to push buttons that open paths and remove barriers. The objective is to reach all the artifacts in each level to progress to the next one. The game involves strategic movement and problem-solving to unlock paths and collect treasures.", "loadsamoney.js": "\"Loadsamoney is an endless tycoon-style simulation game centered around amassing wealth through various upgrades. Players use button presses to generate money and purchase enhancements like money printers, multipliers, and more to exponentially boost their earnings. The ultimate goal is to accumulate significant wealth, showcasing one's financial prowess.\"", "love_lock.js": "\"Love Lock\" is a strategy game where players navigate through levels to find and use keys to unlock a path to reunite with their lover. The main objective is to collect keys, bypass obstacles and barriers, and reach the exit to advance through the levels. Players must strategically manage keys they collect, avoiding tolls that deduct keys to successfully complete each level.", "mailman.js": "In \"Mailman,\" you play as a mailman tasked with delivering packages while avoiding dangerous boxes. Navigate through various levels to reach the conveyor belt without colliding with moving badboxes and evilboxes that can reset your progress. Complete all deliveries to prevent the world from sinking into despair.", "maise.js": "\"Maise\" is a maze-solving game where the objective is to navigate through complex labyrinths and reach the end pad without touching dangerous fires. Players must carefully maneuver through each level using strategic thinking and quick reflexes to avoid restarting the level. The challenge increases as players progress through multiple intricately designed mazes.", "mandelbrot.js": "\"Mandelbrot\" is a sandbox simulation game where players can explore the intricate and fascinating patterns of the Mandelbrot set. Users can navigate the visualization by moving around and zooming in or out to observe different levels of detail. The game allows for a deeper understanding of fractals and is hackable for those interested in tweaking its parameters.", "marble-tilt.js": "Marble Tilt is a puzzle game where players guide a purple marble to a green square while avoiding red/orange lava and navigating around black obstacles and grey borders. Inspired by classic marble tilt games, players control the tilt of the board using directional inputs. The game challenges players with multiple levels, progressively increasing in complexity.", "marble_run.js": "Marble Run is a puzzle game where the objective is to guide a marble to the green flag while avoiding colorful and lava boxes that reset your progress. Each level presents a unique challenge that requires careful navigation and timing. Progress through increasingly difficult levels to reach the final goal.", "matcher.js": "\"Matcher\" is a logic-based puzzle game where players move blocks labeled as \"left\" and \"right.\" The goal is to align matching blocks to clear them from the board and progress through levels. Players navigate and manipulate blocks within a grid to achieve the correct alignments.", "math-quiz-game.js": "Math Quiz Game by Zigao Wang is a competitive two-player quiz game that challenges players with random math questions. Players must race to answer correctly before time runs out, using WASD keys for Player 1 and IJKL keys for Player 2. This game combines quick thinking and rapid responses in a fun and competitive environment.", "mathematical_meteorite.js": "\"Mathematical Meteorite\" is a thematic puzzle game where the player guides a falling meteorite towards the correct campfire based on quick mathematical calculations. The aim is to save the world by matching the meteorite with the campfire displaying the right answer to a given mathematical problem. Correctly solving these problems earns the player wins, while mistakes result in losses, adding a layer of challenge and excitement to the gameplay.", "maze game.js": "\"Ducky Maze Game\" is a puzzle game where players guide Ducky the duck through various mazes to reach his food while avoiding large spikes and moving around lilypads. The game includes elements such as spikes, lilypads, and teleport portals, and features multiple levels of increasing difficulty. The objective is to navigate the mazes, moving from the entrance portal to the exit portal, and ultimately reaching the food without getting hit by obstacles.", "maze-eye.js": "Maze-eye is a multi-level maze game where players must navigate through various mazes while dodging monsters that move horizontally and vertically. The game features increasing difficulty with some levels introducing blind spots, adding to the challenge. The monsters are notable for their giant eye, which ties into the game's thematic design.", "maze.js": "\"Prison Break\" is a maze-style game where the player must navigate a prisoner to the flag to escape from jail. Players encounter various challenges, such as buttons that alter the maze and wardens that chase them, adding urgency to their escape. The game involves strategic movement and quick decision-making to avoid capture and reach the goal.", "maze7.js": "\"Maze\" is a sokoban-style puzzle game where players navigate through levels by moving their character to a green teleporter. The goal is to find a way through obstacles and reach the teleport to advance to the next level. The game features multiple levels with increasing difficulty.", "maze_bird.js": "\"Maze Bird\" is a Sokoban-style puzzle game where players navigate a bird through complex mazes to reach the finish. The objective is to move the bird around obstacles, represented as walls, and complete each level by positioning the bird on the finish tile. The game consists of multiple levels with increasing difficulty.", "maze_game_starter.js": "Maze Game Starter is a simplistic maze navigation game where the player moves through a basic map. The objective is to navigate from the starting point to the endpoint, though the initial setup includes just a minimal two-tile map. Originally authored by Cheru Berhanu, it serves as a foundational framework for developing more complex mazes.", "maze_runner.js": "\"Maze Runner\" is a timer-puzzle game where players navigate a maze filled with obstacles like walls, spikes, and locked paths. The objective is to reach the finish line while collecting keys to unlock new areas and avoiding hazards that reset the level. Each level presents a progressively challenging layout to test the player's problem-solving and navigation skills.", "maze_runner2.js": "\"Maze Runner\" is a maze exploration game where players must navigate through intricate labyrinths, collecting keys to progress and ultimately escape. The game involves managing energy levels, represented by health points, which deplete over time while in the maze. Players must strategically collect items like hearts and apples to maintain their health and avoid enemies.", "mazegame.js": "\"Mazegame is a sokoban-style puzzle game where players must navigate their character through a series of mazes. The objective is to reach the endpoint, marked by a special symbol, while avoiding walls and other obstacles. Each completed level brings a new, more challenging maze to solve.\"", "memory_game.js": "\"Memory Game\" by uped is a classic card-matching game where players test their memory by pairing matching cards to earn points. Players navigate and interact with the board using the WASD keys to move and the 'I' key to flip cards. The game's theme revolves around enhancing memory skills in a fun and engaging way.", "microwars.js": "Microwars is a multiplayer game where players choose sides between Arduino and Raspberry Pi in a battle of microcontrollers versus microprocessors. Using shooting mechanics, players must hit their opponent three times to win by burning their electronic circuits. The game explores the rivalry and debates in the tech community, like Arduino vs. Raspberry Pi.", "mikusDoorsGalore.js": "\"Miku's Doors Galore!\" is a beginner-friendly puzzle game where players navigate Hatsune Miku through mazes to find her leeks. The game involves collecting keys, passing through doors, and avoiding obstacles like magma and trapdoors. The goal is to help Miku progress through levels without being set back or defeated by hazards.", "minesweeper.js": "Minesweeper is a classic puzzle game where players uncover tiles on a 9x9 grid, avoiding hidden bombs and identifying safe tiles by marking potential bomb locations with flags. This version, developed using Sprig, features 10 randomly placed bombs in each game. Players must carefully strategize and use numerical hints to successfully clear the board.", "mini_maze_and_puzzle.js": "\"Mini Maze and Puzzle\" is a strategy game where the player must navigate mazes filled with traps and lava to find the correct door while pushing blocks to their designated medium. The game challenges players to avoid hazards and make strategic moves to progress through increasingly difficult levels. Each level requires careful planning and problem-solving to achieve the objectives.", "missile_mania.js": "Missile Mania is an endless game where the player must dodge missiles that are continuously falling from the sky. If a missile hits the player, the game ends. The objective is to survive as long as possible by moving left and right to avoid the missiles.", "move_the_rocks.js": "\"Move the Rocks\" is a logic puzzle game where players navigate a character to push rocks and clear paths to reach the treasure while avoiding traps. The goal is to strategically move obstacles and solve each level's challenges.", "multiplayer_soccer.js": "\"Multiplayer Soccer\" is a multiplayer puzzle game where players must strategically move boxes to cover all goals on the map. Players navigate through different levels, each containing obstacles and specific goals to achieve. Cooperation and careful planning are key to advancing through the stages.", "music-be-like.js": "\"Music Be Like\" is a logic-based puzzle game where players move around the game grid and groove to some tunes. The goal is to maneuver boxes to specific target positions. Enjoy the vibe and try not to get \"Rick Rolled\"!", "mystery_of_scooter.js": "\"Mystery of Scooter\" is a puzzle game where the player navigates through a series of maps filled with various houses. The objective is to find the correct house and win by receiving directional feedback, indicating how close the player is to the target. It's a work-in-progress game with a simple yet intriguing exploration theme.", "niabtf2.js": "\"Ninja In A Bear Trap Factory 2\" is a strategy game where players navigate a factory filled with bear traps by jumping over them using collected swords. The goal is to press the correct buttons to open and close doors, ultimately finding a way to escape the factory. Enhanced with updated security and graphics, it challenges players to carefully plan their moves to avoid traps and reach their destination.", "nimits_sokoban_super.js": "Sokoban Super is a puzzle game where players push boxes to designated goal locations within each level. With a strong emphasis on sprite design, this version of the classic Sokoban game features various challenging levels that test players' problem-solving skills. The objective is to clear all boxes by placing them on specific targets to advance to the next level.", "nomis.js": "\"Nomis is a Simon-like game created by Cheru Berhanu, where players must replicate sequences of colors and sounds. The theme revolves around classic memory challenges, making it engaging and mentally stimulating. It adds a nostalgic twist to modern gaming by focusing on pattern recognition and recall.\"", "not-dance-dance.js": "This rhythm game, inspired by Dance Dance Revolution and osu!mania, challenges players to hit notes in sync with music. As four lanes scroll notes downward, players press corresponding buttons to match the timing, with accuracy rewarded by an 8-bit rendition of the Tetris theme. The game's theme centers on musical timing, offering a dynamic experience for music and rhythm enthusiasts.", "ocean-maze-escape.js": "Ocean-Maze-Escape is a Sokoban-style puzzle game where two players, a squid and a shark, navigate through mazes to reach their respective goals: the squid to a submarine and the shark to a boat. Players must collaborate and maneuver around obstacles to succeed.", "offline_t-rex_game.js": "\"Offline T-Rex Game\" is an endless running game where the player controls a dinosaur, attempting to avoid obstacles such as cacti. The goal is to achieve the highest possible score as the speed progressively increases. This game offers a simplified version of the famous Chrome offline dinosaur game.", "orb_journey.js": "\"Orb Journey\" is a simple puzzle game where players control a water orb and a lava orb, navigating them through obstacle courses to their respective destinations. The water orb can move through water tiles, while the lava orb can move through lava tiles. The game has a built-in timer, allowing it to be speedrun for better times.", "orbit_blaster.js": "\"Orbit Blaster\" is an action-packed dodging game where you control a spaceship on a mission to save Earth from rampaging asteroids. Navigate through space, avoiding obstacles and shooting down asteroids to score points. The game features different difficulty levels to challenge players.", "osu-mania.js": "osu-mania is a rhythm game inspired by osu! Mania and Piano Tiles, where players must hit notes in time with the beat of a song. Notes fall from the top of the screen towards a red bar, and players use four specific keys to hit them as they cross the bar. The game tests timing and coordination skills to achieve the highest score possible.", "parachute_panic.js": "\"Parachute Panic (in Sprig)\" is an obstacle-dodging game inspired by an old Java game, where players navigate a parachutist using logic-based movements to avoid clouds and UFOs while aiming to land on boats for safety. The goal is to stay airborne and dodge hazards for as long as possible, collecting tokens like cranes for score boosts, and avoid landing in water, which halves your score. The game incorporates elements of skill and timing as players attempt to maximize their score before safely landing.", "penguin_slide.js": "Penguin Slide is a strategy puzzle game where the player slides a penguin across an icy landscape to collect coins and reach a portal. The penguin slides in straight lines until it hits an obstacle, requiring careful planning to navigate the levels successfully. The game progressively introduces more complex challenges, including avoiding water and collecting all coins before reaching the goal.", "pipes_puzzle.js": "Pipes Puzzle is a logic-based game where the objective is to connect all the pipes in a grid, ensuring they are properly rotated to form a continuous path. Players navigate through different levels, each randomly generated and solvable, and aim for achieving a blue background upon successful connections. The game, created by RayhanADev, emphasizes problem-solving and spatial reasoning skills.", "pixelated_medieval_times.js": "Pixelated Medieval Times is a retro-style RPG game where players navigate through medieval-themed levels, collecting keys and swords to defeat bosses and save a princess. The game incorporates elements of exploration and combat as players advance through various maps. The primary goal is to overcome obstacles and enemies to achieve victory.", "plants_vs_zombies.js": "\"Plants vs. Zombies\" is a strategy game where you defend your garden from waves of zombies by planting different types of defensive and offensive plants. Each plant has unique abilities, such as shooting peas, slowing down zombies, or acting as a barrier, and requires sunlight points to be deployed. The goal is to kill 10 zombies and prevent them from reaching the stone, ensuring the safety of your garden.", "platform_rogue.js": "\"Platform Rogue\" is an advanced platformer game where players navigate through levels filled with walls, coins, and spikes. The objective is to reach the end of the level while avoiding or overcoming obstacles that can kill the player. The game includes elements of jumping, gravity, and falling blocks, creating a dynamic and challenging environment.", "pocket-piano.js": "\"Pocket Piano is a simulation game that allows users to play simple tunes on a virtual piano. Each key corresponds to a musical note, providing an easy way to create melodies. The game highlights the notes visually as they are played, making it a fun experience for those interested in music.\"", "pong-multiplayer.js": "\"Pong-multiplayer\" is a multiplayer version of the classic Pong game, allowing two players to compete head-to-head. The game uses simple graphics and mechanics, with each player controlling their paddle to hit a bouncing ball back and forth. The first player to reach 10 points wins.", "pong.js": "\"Pong is a classic arcade game where the player competes against a naive AI in a table tennis match. The objective is to score points by hitting a ball past the opponent's paddle. The game features simple graphics and sound effects, reminiscent of the original Pong experience.\"", "pong_irtaza2009.js": "\"Pong is a 2-player remake of the classic arcade game. Players control paddles to bounce a ball back and forth, aiming to prevent it from hitting their own walls. The game ends when the ball touches a player's wall, at which point they lose.\"", "portal_game.js": "\"Portal Game\" is a logic puzzle game where the goal is to move boxes to designated flags using portals. Players must navigate through obstacles and strategically use portals to transport boxes and reach the flags. Each of the 8 levels presents unique challenges requiring thoughtful planning and problem-solving.", "purge.js": "\"Purge\" is a puzzle game inspired by Sokoban where the objective is to cover all the purple tiles with green tiles by moving boxes around the map. Players navigate through different levels featuring obstacles like walls that must be maneuvered strategically to achieve the goal.", "push_the_blocks.js": "\"Push the Blocks\" is a Sokoban-style puzzle game where players push green boxes onto green shapes and red boxes onto red shapes to complete levels. The game involves strategic movement to ensure each box is placed on the correct target.", "pusher_game.js": "Pusher is a strategy game where players navigate through mazes filled with obstacles to reach a final destination. Players must plan their moves carefully to push objects and clear a path to the goal. The game includes multiple levels with increasing difficulty.", "puzzle_runner.js": "Puzzle Runner is a Sokoban-style game where you navigate through a maze while pushing a box to reach the goal. Each level presents a different challenge, and you must solve all the puzzles to win. It's a logic-based game that requires strategic thinking and careful planning.", "pyre.js": "Pyre is a strategy game where the objective is to burn down the blue hut by spreading fire across the environment. Players navigate through different levels, strategically placing flammable objects and avoiding obstacles to achieve their goal. The game challenges players to think critically about how fire spreads and utilize environmental elements effectively.", "racer.js": "\"Racer\" is a classic lane-switching game where you maneuver a car to avoid obstacles and reach the goal. The levels increase in difficulty, requiring quick reflexes and strategic lane changes. The game focuses on logical thinking and timing to safely navigate through each level.", "racing_game.js": "\"Car Race\" is a strategy game where players drive around a lawn to collect all pieces of grass and then proceed to a blue checkpoint to advance to the next level. Players must navigate around obstacles and avoid certain tiles to successfully complete each level.", "random_maze_game_with_dfs_algorithm.js": "This game features a randomly generated maze using a depth-first search (DFS) algorithm. The main objective is to navigate the player (represented by a red square) to reach the target (a green square). It is an endless game centered around maze-solving skills and graph theory learning.", "randomworld.js": "\"Randomworld\" is an exploration game where players navigate through a randomly generated world filled with enemies and various structures. The main goal is to explore, collect items, and level up by defeating enemies. Players can enter and use computers within bases to perform various tasks, including enabling portals for teleportation.", "raycasting.js": "\"Raycasting Demo\" is an advanced display of raycasting techniques in a grid-based environment. Players navigate a 3D space to visualize rendered walls and the player's perspective on a mini-map. There is currently no objective within the game.", "reactor.js": "\"Reaction Timer\" is a two-player game that tests how quickly each player can react to different colors. Players are assigned specific keys for each color and must press their corresponding key faster than their opponent when a color appears. The game measures and displays reaction times in milliseconds, making for a fun and competitive experience.", "really_really_bad_music_maker.js": "\"Really Really Bad Music Maker\" is a generative music game that allows players to explore Sprig's sonic capabilities by influencing a simple algorithm. Players can control the music by starting and stopping playback, changing sounds, shifting octaves, and selecting note scales to create different musical patterns. The game demonstrates how various musical elements can be manipulated programmatically to produce unique and varied compositions.", "red_light_green_light.js": "\"Red_light_green_light\" is a strategy game where players navigate through multiple levels, collecting at least three coins per level to progress. Players must move roadblocks to reach their goal while adhering to a timer and avoiding movement during red lights. The game combines problem-solving with timing challenges to create an engaging experience.", "rescue_leo.js": "\"Rescue Leo\" is a thematic puzzle game designed to raise awareness about sea turtles and environmental conservation. Players navigate Leo, the sea turtle, through various levels filled with trash while avoiding obstacles to reach the goal. The game emphasizes the impact of pollution on marine life and encourages eco-friendly practices.", "rescue_your_chinchilla.js": "\"Rescue your chinchilla by pushing it back home while collecting coins along the way. Use teleporters and levers to navigate through challenging levels, unveiling new possibilities to complete your mission. Enjoy the lively music that accompanies you throughout the game!\"", "restocker_simulater_sprig.js": "\"Restocker Simulator\" is a challenging Sokoban-style puzzle game where two players navigate through levels, pushing boxes to designated goal areas. Each player has distinct controls and must work together to complete the tasks, resetting levels if necessary. The game emphasizes cooperation and strategy between the players.", "reversi.js": "Reversi is a classic strategy board game for one or two players, where the goal is to capture as many opponent's pieces as possible by trapping them between your own. The game is played on an 8x8 grid, and players take turns placing their pieces on the board to flip opponent's pieces. The game ends when neither player can make a legal move, and the player with the most pieces wins.", "rickroll.js": "This game is essentially an animated rickroll created for Sprig. The game presents an ever-changing animation that uses various patterns and color combinations to engage the viewer. Simply running the program initiates the animated sequence.", "roodkapje.js": "\"Roodkapje\" is a beginner-friendly maze game where players must navigate their way to a house while avoiding wolves. Players move their character using the WASD keys. The game's primary objective is to reach the house without colliding with any wolves.", "run.js": "\"Run\" is a logic-based game where the player must navigate a maze and avoid being hit by moving rockets coming from different directions. The player earns points by surviving as long as possible without collision.", "sPaint!.js": "\"sPaint! is a sandbox-style game that allows users to create and erase pixel art on a blank canvas. Players can toggle between placing pixels and using an eraser, as well as reset the canvas. The game emphasizes creativity and will soon include features like adding colors.\"", "santas_workshop.js": "\"Santas_Workshop\" is a Sokoban-style puzzle game where players control an elf to push presents onto designated spots, represented by yellow tiles. The objective is to cover all target tiles with presents to progress through various levels designed with walls and obstacles. The game incorporates increasing complexity with each level.", "scrolling_maze.js": "\"Scrolling Maze\" is a game where players navigate through a large, scrolling maze with the objective of reaching the end. The game features limited visibility and collision mechanics to enhance the challenge. This game is designed as a test for implementing scrolling maps in JavaScript.", "seven_ate_nine_789.js": "Seven Ate Nine is a fast-paced, 2-player game where one player controls the number 7 and the other controls the number 9. The objective for player 7 is to catch player 9, while player 9 must avoid being caught and escape past a black line. If 9 escapes, an 8 will start chasing player 7, and the game intensifies as the 8 accelerates over time.", "shark dodger.js": "\"Shark Dodger\" is a fast-paced dodge game where players aim to survive as long as possible by dodging harpoons and collecting fish for extra lives. Navigate through an oceanic landscape avoiding dangerous objects to prolong your character's health. The challenge lies in quick reflexes and strategic movement to keep from being captured or struck.", "shitpest.js": "Shitpest is a strategy game that mimics the classic arcade game Tempest, challenging players to defend their position by moving along a predefined path and shooting incoming enemies. Players can also use a super attack to clear all enemies on screen, adding a strategic layer to the fast-paced action. The game focuses on achieving a high score while managing limited resources and dodging threats.", "shoot_green_blobs.js": "\"shoot_green_blobs\" is a classic-themed shooting game where the player controls a character that fires at enemies represented by green blobs. The goal is to survive waves of enemy attacks while shooting to destroy them and scoring points. The game's challenge increases with enemy movements and attacks, providing an engaging test of reflexes and strategy.", "shooter.js": "\"**Shooter** is a survival strategy game where players must fend off waves of zombies using a limited supply of ammo. Players navigate through the map, strategically managing their resources and reloading when necessary to survive as long as possible. The game ends when the player is overrun by zombies.\"", "silicon-valley-obby.js": "\"Silicon Valley Obby\" is a platformer game where the player helps Richard Hendricks collect his friends through various levels to reach his presentation at TechCrunch Disrupt. The game involves navigating through obstacle courses, collecting characters, and reaching the door to advance to the next level, avoiding code-bug-filled lava along the way.", "simon.js": "\"Simon\" is a 2x2 puzzle game where players have to remember and recreate an increasingly complex sequence of tiles that light up and play sounds. The objective is to correctly repeat the pattern for as long as possible before making an error. When a mistake is made, the game shows the player's score and restarts.", "simple_maze.js": "\"Simple Maze\" is a sokoban-style puzzle game where players navigate through a series of mazes to reach a goal. The game consists of multiple levels, each with its own unique layout and obstacles. Players must carefully move around walls and other barriers to guide their character to the goal.", "skyrace.js": "\"Skyrace\" is a multiplayer game where players control planes to avoid collisions with mountains. The green indicator plane is controlled with WASD keys, while the orange indicator plane is controlled with IJKL keys. The objective is to skillfully maneuver your plane to outlast your opponent.", "slot_machine.js": "\"Slot Machine\" is a classic gambling game developed by Alexander Li, where players press 's' to spin and match symbols like 7, C, B, and X for a chance to win. The theme centers around a traditional slot machine experience, aiming to replicate the excitement of hitting the jackpot.", "snake_against_a_friend.js": "\"Snake against a friend\" is a competitive multiplayer game where two players control their own snakes, aiming to outlast each other. Player 1 uses WASD keys, and Player 2 uses IJKL keys to navigate. The game gets progressively faster each round, increasing the challenge and intensity.", "snake_feast.js": "Snake Feast is a classic snake game where the player controls a snake to eat oranges scattered around the map while avoiding obstacles and walls. As the snake consumes oranges, it grows longer, making the game progressively challenging. Game over occurs if the snake runs into an obstacle, wall, or its own body.", "snake_game.js": "\"snake_game\" is a classic arcade game where players control a snake as it navigates a grid, consuming food to grow longer while avoiding collisions with its own body and the borders. The game tests the player's reflexes and planning skills as they try to achieve the highest score possible by guiding the snake to eat food and grow. With simple controls and increasing difficulty, it offers an engaging challenge reminiscent of early video games.", "snakey_snake.js": "\"Snakey Snake\" is a strategy game where the player controls a character to eat apples and collect power-ups that allow them to eat rocks. The player must navigate through levels, avoid bombs, and ultimately reach the character named Orphy. The game is a work in progress, with new levels being developed.", "snek.js": "\"Snek\" is a classic snake-style game where the objective is to navigate the snake to collect fruit scattered on the board. The snake grows longer with each fruit collected, and the game ends if the snake collides with itself or the walls. Simple yet engaging, the game challenges players to manage the growing length while maximizing their score.", "soko_quest.js": "\"Soko Quest\" is a logic-based puzzle game where players push various types of blocks to create a path to the \"golden g\" and advance to the next level. Players must strategically maneuver brown and green boxes to push corresponding brick-like blocks out of the way. The game challenges players to think ahead and solve complex block-pushing puzzles to reach their goal.", "sokoban.js": "\"Sokoban is a puzzle game where the objective is to cover all the green goal tiles with purple boxes. The player navigates through levels by pushing boxes around obstacles and walls. It's designed for beginners and is highly hackable for those who want to modify or extend the gameplay.\"", "sokoban_plus.js": "Sokoban+ is a puzzle game with 25 levels where players must push different types of boxes to their corresponding goals. There are three types of boxes (cyan, magenta, and gray) and three types of goals (green, red, and gray). The challenge is to match each box type with its specific goal while navigating through various obstacles.", "sokobanlike.js": "\"Sokobanlike\" is a puzzle game inspired by Sokoban, incorporating portals in advanced levels. Players push boxes to their designated goals while navigating through increasingly complex maps. The game also introduces a portal mechanic in later stages to add an extra layer of challenge.", "solar_system.js": "\"Solar_system is a simulation game that visualizes the planets orbiting the sun. The planets, including Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune, move in circular paths around the sun. This educational simulation helps users understand planetary motion, though the scale is inaccurate.\"", "son_of_a_lich.js": "\"Son of a Lich\" is a turn-based RPG where you play as a knight searching for their missing father near a dangerous castle occupied by a lich. Navigate through different levels, fight armored enemies, and interact with NPCs to uncover clues. The game's objective is to defeat the lich and reveal the truth about your father's disappearance.", "soul-stealer.js": "\"SOUL STEALER: The Vengeful Spirit\" is a 2D horror game where you must help Darius, a wealthy man who died in a car crash, escape an evil spirit to reach the afterlife. The game features an eerie and spooky atmosphere, requiring players to navigate various levels filled with obstacles and jumpscares, and solve puzzles to progress. The objective is to traverse through the spirit's world and evade the vengeful entity to find peace.", "space-invaders.js": "\"Space Invaders, created by Carmel Barkaee, is a strategy game where players must defend Earth from waves of alien invaders. Using a spacecraft, players shoot down advancing enemies and protect shields to survive. The goal is to eliminate all aliens before they reach the planet's surface.\"", "space_adventures.js": "Space Adventures is a 2D platformer game where players navigate through 15 progressively challenging, space-themed levels. The primary objective is to reach the goal sprite at the end of each level to progress. Upon completing all levels, the player wins the game.", "space_shooter.js": "\"Space Shooter\" is an action-packed game where players defend themselves from enemies descending from the sky. Players control the ship's movement to dodge and fire bullets at enemies. The goal is to survive as long as possible while increasing the score by destroying enemy ships.", "speedy_snake.js": "\"Speedy Snake\" is a new take on the classic snake game where the snake's speed increases instead of its size each time it eats an apple. This unique mechanic makes it progressively more challenging to maneuver the snake and avoid hitting the walls. It features both an easy and hard mode to cater to different skill levels.", "spiano.js": "\"Spiano\" is a virtual piano game where players can create music by pressing specific keys on their keyboard. Each key produces a different 8-bit musical note, allowing for a unique and retro musical experience. The game blends the fun of playing an instrument with the charm of nostalgic sound.", "spider_home.js": "\"Spider Home\" is a sokoban-style puzzle game where a spider navigates through obstacles and mines to reach its home. The player must strategically maneuver the spider and be patient due to the effects of gravity, waiting for the right moments to avoid restarting the level. The game involves progressing through multiple levels, each with unique challenges.", "spirit-bound.js": "Spirit Bound is a 2D puzzle game where players navigate through a series of complex rooms filled with hostile spirits that mimic their movements. The objective is to collect keys, open doors, and reach the exit while avoiding damage from the spirits. The game features 16 maps and 4 challenge maps, designed so that each level can be completed without taking damage.", "spongebob_squaremaze.js": "\"Spongebob Squaremaze\" is a maze-based game where players must navigate through labyrinthine levels and eliminate enemies to progress. The game features various types of enemies and increasingly challenging maps. Players must strategically move through the maze to find and defeat all opponents before advancing to the next level.", "sprig-edit.js": "Sprig-Edit is a simple text editor designed for the Sprig platform by Colack. It allows users to create text by selecting and placing characters from a limited set of 56 options onto a 16x15 grid. This utility focuses on basic text composition and manipulation within the constraints of the Sprig environment.", "sprig_clicker.js": "\"Sprig Clicker\" is an endless incremental game where players click on a sprig to earn more sprigs and purchase upgrades from a shop. The objective is to accumulate 2 million sprigs, after which the game can continue indefinitely. The core mechanics revolve around collecting resources, buying enhancements, and increasing efficiency through various upgrades.", "sprig_dodge.js": "Sprig Dodging is a beginner-level tutorial game where players control a character to dodge falling obstacles. The game involves moving the player left or right to avoid randomly spawned obstacles that descend from the top of the screen. The game ends when an obstacle collides with the player, displaying a \"Game Over\" message.", "sprig_machine.js": "Sprig Machine is a sandbox game where players control various cell types such as Movers, Generators, Rotators, Push cells, Slide cells, Enemies, and Trashes. Each cell has specific behaviors and interactions, challenging players to strategically place and manipulate cells to achieve objectives. Inspired by Cell Machine Mystic Mod, this game offers a unique blend of puzzle and strategy elements within a grid-based environment.", "sprig_shoot.js": "In \"Sprig Shoot,\" players must defend themselves by shooting incoming enemies while avoiding bombs. Successfully hitting an enemy earns points, while allowing enemies to pass decreases the score; hitting a bomb results in an instant game over. It is an endless shooter game that tests reflexes and accuracy.", "sprigadventure.js": "\"Sprig Adventure\" is an advanced maze game where players navigate through various levels while dodging fireballs and other hazards. The goal is to reach the green box at the end of each level, overcoming obstacles and collecting items along the way. Successfully passing all levels leads to a cheerful win screen.", "spriggy_morse.js": "\"Spriggy Morse is an educational game designed to teach players how to type in Morse code. Players input dots and dashes to form Morse code characters and convert them to letters to match a given word. The game offers a fun way to practice and learn Morse code.\"", "spriggymon.js": "Spriggymon is a JRPG inspired by Pokemon, featuring a narrative-driven experience that promises an absence of bugs or confusing storylines. The game revolves around character battles with a blend of strategic combat and adventure. Players engage with unique characters, each having distinct abilities, in a quest-driven storyline within diverse environments.", "sprigish.js": "\"Sprigish\" is a puzzle game that is a recreation of \"Dadish\". The player, a radish dad, must navigate through various levels to find his missing radish kids. The gameplay involves moving through obstacles and avoiding hazards to reunite the family.", "sprigle.js": "\"Sprigle\" is a Wordle port adapted for the Sprig platform, where players guess five-letter words. It retains the classic Wordle elements, requiring logical thinking and vocabulary to deduce the correct word within limited tries. It appeals to fans of word puzzles and classic gaming.", "sprigmusicstreaming.js": "\"Sprig Music Streaming\" is a music-themed game where players can select and listen to various recreations of songs by navigating through three different albums: Kanye West’s MBDTF, Tom Petty’s Full Moon Fever, and Clairo’s Immunity. By using the cursor, players can choose specific tracks to play from each album, offering a unique and interactive way to experience these musical pieces.", "sprigorous-vigor.js": "\"Sprigorous Vigor\" is a maze-based puzzle game where players navigate through mysterious levels, seeking portals to progress. Players must push obstacles strategically to clear their path. Each level presents unique challenges and occasionally offers cryptic messages to guide or mislead.", "squarey_runs_away_from_the_fireball.js": "\"Squarey Runs Away From the Fireball\" is a multiplayer game where one player controls \"Squarey\" and the other controls a fireball. The goal for Squarey is to avoid being caught by the fireball for 30 seconds, while the fireball aims to catch Squarey using different keys for movement. If Squarey survives for the specified duration, they win; otherwise, the fireball wins.", "starjump.js": "Starjump is a sokoban-style maze game where the objective is to collect all the stars to complete each level. Players navigate through the maze using WASD keys, sometimes needing to obtain keys to access stars and progress to the next level. The game features various wall and obstacle types that create increasingly challenging puzzles.", "stopwatch.js": "\"Stopwatch\" is a utility application designed for accurate timekeeping. It allows users to start, stop, reset, and record split times effortlessly. Ideal for situations requiring precise time measurements.", "sudoku.js": "This classic Sudoku game challenges players to fill a 9x9 grid so that each row, column, and 3x3 section contains all digits from 1 to 9. With default difficulty set to \"very-hard\", users can adjust difficulty by modifying a specific line in the code. The game visually indicates the cursor and incorrect values using a yellow and red border respectively.", "sweepar.js": "Sweepar is a hybrid minesweeper-inspired game where players navigate a grid using their instincts, without visibility of adjacent bombs. They control a tiny cursor to open or flag squares, aiming to identify bombs and clear the grid. The suspenseful gameplay challenges users to make strategic decisions and rely on their intuition.", "tag-your-buddy.js": "\"Tag Your Buddy\" is a puzzle game where you control a black character trying to reunite with a red character. Navigate around blue characters and obstacles to reach your goal and advance through progressively challenging levels. Reset levels or the entire game if needed and aim to overcome all challenges to finish the game.", "taikoMania.js": "\"taikoMania\" is a rhythm game inspired by osu!mania and Taiko no Tatsujin, challenging players to hit notes in sync with the music. Players aim to achieve the highest score by precisely timing their inputs to match the beats of various songs. This game offers a simple interface but requires sharp timing and rhythm, making it both engaging and demanding.", "taiko_fever.js": "Untitled Taiko Game is a rhythm game inspired by Taiko no Tatsujin and osu!taiko, where players hit red and blue notes in sync with the music. Notes travel from right to left, and players use two keys for red notes and two keys for blue notes to hit them accurately at the correct time. The game features multiple beatmaps and difficulty levels, with performances evaluated based on accuracy and timing.", "tanks.js": "In \"Tanks,\" two players engage in a PvP (player versus player) battle by controlling tanks that automatically move every 500 milliseconds. Players use different sets of keys to change their tank's direction and shoot projectiles toward their opponent, with the goal of hitting the other tank to win the game. The game features a pre-match color picker for players to select their tank's color, ensuring no two tanks are the same color.", "techCatcher.js": "Tech Catchers V2 is an endless shooter game where players catch falling tech items to earn points while avoiding robots that decrease their score. Players can also shoot the robots to prevent them from causing point deductions. Inspired by simple catch-the-object games, this game combines quick reflexes with strategic shooting.", "tetris.js": "This version of the classic game Tetris features dynamically generated sprites and maps to accommodate pieces of different sizes, ensuring more accurate gameplay with proper collision detection. The goal is to place falling shapes in such a way that they form complete horizontal lines, which then clear out to make more space. The game also includes background music to enhance the gaming experience.", "the-maze.js": "\"The Maze\" is a puzzle game where players navigate through various levels by pushing boxes to designated goals. The game features different difficulty settings, including easy, medium, and hard levels, each offering increasingly complex mazes and challenges. Players must strategically move and position the boxes to progress through the levels and ultimately win the game.", "the_RUN.js": "\"The RUN is a fast-paced game where players navigate a character across a series of obstacles, similar to the mobile game 'Crossy Road.' The objective is to avoid various enemies and reach the end goal without being caught. Developed by a young programmer, the game features engaging collision dynamics and random enemy movements to challenge players.\"", "the_dining_room_in_the_sky.js": "\"The Dining Room in the Sky\" is a puzzle-score game where you catch various objects falling from the sky and sort them to achieve a high score. Eat the meat for points and correctly sort other items into recycle or trash bins. The core challenge is to manage and increase your score by swiftly catching and sorting the falling items efficiently.", "the_great_robbery_ jailbreak!.js": "\"Jailbreak\" is a 2-player adventure game where players, acting as robbers, navigate through various maze-like levels to reach the finish line. As players progress, they may encounter gates that require keys to open, and each player's score is tracked as they advance. The game features colorful graphics and engaging melodies to enhance the cooperative or competitive experience between the two players.", "the_hungry_mouse.js": "\"The Hungry Mouse\" is a strategy game where you navigate a mouse to collect various types of cheese while avoiding traps. Each level presents a new maze where the goal is to gather all the cheese items without getting trapped, progressing to more complex levels as you succeed. Created by KaiEtkin, the game challenges your planning and maneuvering skills to ensure the mouse's survival and success.", "the_impossible_puzzle.js": "\"The Impossible Puzzle is a challenging logic game where players must move tiles around to recreate a specific image. The game is notoriously difficult, often requiring patience and careful planning to solve. Suitable for puzzle enthusiasts looking for a tough challenge.\"", "the_invisible_man.js": "\"The Invisible Man is a puzzle game where the player must collect coins while controlling an invisible character. Players need to keep track of the character’s unseen position to successfully find and gather coins. Debug information is available in the console for those who need assistance.\"", "the_journey_of_the_box_a_sokoban_saga.js": "\"The Journey of the Box: A Sokoban Saga is a puzzle game where players push blue boxes into designated holes. Some levels include buttons that, when pressed with boxes, make walls disappear. The game features increasingly challenging levels with a mix of strategy and problem-solving elements.\"", "thunder_bowl.js": "\"Thunder Bowl\" is a puzzle game where the player needs to push all the footballs into their respective goals. The gameplay involves navigating a player character through various levels filled with obstacles and strategically positioning the balls in the correct spots. The theme revolves around football, and it challenges the player's strategic thinking and problem-solving skills.", "tictactoe.js": "\"2 Player Tic-Tac-Toe\" is a classic multiplayer game where two players take turns placing Xs and Os on a 3x3 grid in an attempt to form a straight line horizontally, vertically, or diagonally. The game ends when one player achieves this or when all tiles are occupied with no winner. It incorporates simple key inputs to control and place the pieces.", "time_puzzle.js": "\"Time Puzzle\" is a timer-based puzzle game where the objective is to move a box to a green square within a designated time limit. Players navigate through increasingly challenging levels while racing against the clock. The game emphasizes both strategic planning and quick reflexes.", "timing.js": "\"Timing\" is an action-packed game where a stickman battles various bosses. Players must strategically shoot at the bosses while dodging incoming attacks to survive. The objective is to defeat all bosses without getting hit.", "tolls.js": "Tolls is a puzzle game where players navigate through levels by collecting coins to pay tolls and passing through doors. The objective is to reach the green block, representing the exit, while managing limited resources effectively. Each door costs one coin to pass through, adding strategic value to coin collection and movement decisions.", "topdownshooter.js": "\"Top Down Shooter,\" created by Orkpeko, is an action-packed, real-time strategy game where players navigate through a hostile environment from a top-down perspective. The goal is to avoid enemies and survive as long as possible while shooting in four directions. The game emphasizes quick reflexes and strategic movement.", "tower_of_hanoi.js": "Tower of Hanoi is a classic puzzle game where the objective is to move a stack of disks from one post to another, following specific rules. You can only move one disk at a time, and a larger disk cannot be placed on top of a smaller disk. The game starts with two disks and increases in difficulty as you progress.", "tunnel.js": "\"Tunnel\" is an endless game where you navigate a space shuttle through a constantly narrowing tunnel. The objective is to survive for as long as possible without touching the tunnel walls. If the shuttle makes contact with the walls, the game ends.", "turtle_game_reach_the_beach.js": "\"Turtle Game: Reach the Beach\" is a logic-based game where players navigate a turtle across various levels of sandy beaches, with the goal of reaching the ocean while avoiding hazards like seagulls and crabs. The game challenges players to think strategically as they move vertically and horizontally to escape dangers. Thematically, it revolves around guiding the turtle to safety in a vibrant beach setting.", "two-birds_one-stone.js": "\"Two Birds, One Stone\" is a dodge game where players control two birds trying to evade an aggressive stone-thrower. The objective is to keep both birds safe; if even one bird gets hit, the game ends. This game challenges players to maintain coordination and timing to ensure both birds survive.", "type_or_die.js": "\"Type_or_die\" is a fast-paced typing game where players must type out words displayed on the screen before the timer runs out. Using WASD keys to navigate to the desired letter and J to select it, players try to form words quickly to earn points. If the time expires before completing the word, the game ends.", "uav.js": "\"UAV is a game where the player must navigate a ship and avoid incoming UAVs. The objective is to survive as long as possible while UAVs continuously spawn and descend towards the player. The game gets progressively more challenging as the frequency of UAVs increases.\"", "under_fire.js": "\"Under Fire is a strategy game where players must survive waves of laser attacks by repairing their spaceship and managing resources. As the game progresses, new mechanics are introduced, and the difficulty increases. Ultimately, players aim to achieve a score of 50 and defeat the enemy by shooting back.\"", "underground_escape.js": "\"Underground Escape\" is a dungeon-themed puzzle game where your objective is to navigate through a series of mazes to find the correct key and unlock your way out. The game presents various obstacles including fake doors and moving walls meant to trick and challenge you. With a focus on exploration and problem-solving, you'll have to be clever and persistent to escape.", "video-game-exclamation-point-times-three.js": "\"Video-Game-Exclamation-Point-Times-Three\" is a puzzle game where the player controls a smiley face character to navigate various levels, pushing blue blocks and using teleportation portals to reach the flag. The game features distinct elements such as walls and solid objects, and players must figure out the correct path to solve each puzzle. The music and visual design elements contribute to the overall fun experience.", "virus_plowing.js": "\"Virus Plowing\" is an endless game where the player controls a character to push a shield into infected tiles to clear them. The objective is to avoid direct contact with the viruses while using the shield to remove them from the board. The gameplay involves strategic movement and timely actions to keep the board clean of infections.", "walk_in_order.js": "\"Walk-In Order\" is a puzzle game where players navigate through increasingly complex mazes filled with colored blocks. To progress, players must step on these blocks in a specific order displayed at the top of the screen, restarting the level upon any misstep. The game introduces additional colors and more intricate mazes as the player advances through the levels.", "waste_time_get_500_coins.js": "\"Get 500 Coins\" is a time-waster game where the objective is to collect coins to achieve the highest score. The twist is that the player can fall after jumping and moving. Avoid fake coins, as landing on them results in a game over.", "wet-sand.js": "\"wet-sand\" is a falling sand simulation game inspired by projects like TodePond's SandPond. Players can place different elements such as sand, water, and solid blocks on the grid, and watch how they interact with each other. Fish, which have a small chance to appear, swim through water, creating dynamic and engaging patterns.", "whack_a_mole.js": "\"Whack-A-Mole\" is an endless game where players try to whack moles as they pop up from their holes while avoiding bombs. The game becomes increasingly difficult as more bombs appear over time. The objective is to achieve the highest score possible by whacking moles and dodging bombs.", "wham.js": "\"Wham!\" is a simple, fast-paced game where the objective is to hit a \"monster\" popping out of green pipes as many times as you can. It features a grid of tunnels where monsters randomly appear, and the player moves horizontally or vertically to whack them. The game is categorized as a classic and was created by Aaman Patnaik.", "wheatfield.js": "\"WheatField\" is a farming simulation game where the primary objective is to plant and harvest different types of crops, mainly flowers, to gather seeds. These seeds can be sold for tokens, which players can then use to upgrade their seeds and expand their farming potential. The game involves various interactions like harvesting in the order of planting, managing crop disappearance, and interacting with villagers to enhance gameplay.", "yet_another_platfomer.js": "\"Yet Another Platformer\" is a small platformer game where players control a character navigating through various levels to reach a diamond-shaped black goal. Each level presents obstacles and block structures that the player must jump over or maneuver around to succeed. The game's theme revolves around classic platforming challenges and progressive difficulty.", "yondus_Arrow.js": "\"Yondus_Arrow is a Sokoban-style puzzle game where players navigate an arrow through various mazes filled with walls. The objective is to cover all target tiles represented by specific symbols on the grid. Each level becomes progressively more challenging, providing a rewarding experience for puzzle enthusiasts.\"", "zap.js": "\"Zap\" is a multiplayer game by Samvid Konchada where 2 players race through maze-like levels to reach a goal. Players \"zap\" to move quickly through the levels, and the first player to win 3 rounds wins the game. The game emphasizes fast-paced competition and strategic movement.", "zombie_defense.js": "\"Zombie Defense\" is an endless zombie shooter game where players aim to achieve the highest score while managing limited bullets and surviving progressively harder waves of zombies. Players move, shoot, and reload as they fend off zombies that continuously spawn and advance toward their position. The game challenges players to balance between shooting zombies and managing reload times to survive as long as possible."}